------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/henryrobinson/Desktop/3rd year/AED/Stata/fianltestdiss.log
  log type:  text
 opened on:  29 Oct 2021, 14:18:31

.  
. use "data_Set_radio.dta" , clear 

.  
. *Then merge to second dataset, drop _merge and merge to third by observation* 
.  
. merge 1:1 _n using "/Users/henryrobinson/Desktop/3rd year/AED/Stata/data_Set_socio_demo.dta" 

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            15,363  (_merge==3)
    -----------------------------------------

.  
. drop _merge  

.  
. merge 1:1 _n using "/Users/henryrobinson/Desktop/3rd year/AED/Stata/data_Set_vote.dta" 

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            15,363  (_merge==3)
    -----------------------------------------

.  
. save merged_data, replace 
file merged_data.dta saved

.  
. *Destring year variable 
. encode year, generate(yearDes) 

.  
. *Remove years that are irrelevant 
. drop if yearDes==1 | yearDes == 2 | yearDes == 3 | yearDes == 9 | yearDes == 10 | yearDes == 11 | yearDes == 12 | yearDes == 13 | 
> yearDes == 14 | yearDes == 15
(10,240 observations deleted)

.  
. *Remove outlier from inspection 
. drop if calendar_year =="19" 
(3 observations deleted)

.  
. *Create dummy variables for each year 
. ta yearDes, gen(yeardum) 

    yearDes |      Freq.     Percent        Cum.
------------+-----------------------------------
       n285 |      1,024       20.00       20.00
       n309 |      1,024       20.00       40.00
       n327 |      1,024       20.00       60.00
       n32n |      1,024       20.00       80.00
       n333 |      1,024       20.00      100.00
------------+-----------------------------------
      Total |      5,120      100.00

.  
. *Create FE controls by multiplying election dummies by controls 
. 
. forval x=1/5{
  2.         gen pop_`x' = pops * yeardum`x'
  3.         gen pop_2_`x' = pops_2 * yeardum`x'
  4.         gen pop_3_`x' = pops_3 * yeardum`x'
  5.         gen pop_4_`x' = pops_4 * yeardum`x'
  6.         gen pop_5_`x' = pops_5 * yeardum`x'
  7.         gen jewishpop`x' = c25juden_share * yeardum`x'
  8.         gen cathpop`x' = c25kath_share * yeardum`x'
  9.         gen bluecollar`x' = c25arbei_share * yeardum`x'
 10.         gen whitecollar`x' = c25anges_share * yeardum`x'
 11.         gen city`x' = city * yeardum`x'
 12.         gen warparticipant`x' = war_per1000 * yeardum`x'
 13.         gen welfare`x' = in_welfare_per1000 * yeardum`x'
 14.         gen socialrent`x' = sozialrentner_per1000 * yeardum`x'
 15.         gen proptax`x' = logtaxprop * yeardum`x'
 16.         gen altitude`x' = altitude * yeardum`x'
 17.         gen unemployed`x' = c33erlos_share * yeardum`x'
 18.         gen partemploy`x' = c33brlos_share * yeardum`x'
 19.         gen bigd`x' = bigd * yeardum`x'
 20.         gen turnout`x' = turnout24 * yeardum`x'
 21.         gen dnvpshare`x' = vote24 * yeardum`x'
 22.         gen nsfpshare`x' = nsfb24 * yeardum`x'
 23.         gen spdshare`x' = spd24 * yeardum`x'
 24.         gen zentrumshare`x' = z24 * yeardum`x'
 25.         } 
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(165 missing values generated)
(165 missing values generated)
(165 missing values generated)
(235 missing values generated)
(5 missing values generated)
(180 missing values generated)
(180 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(165 missing values generated)
(165 missing values generated)
(165 missing values generated)
(235 missing values generated)
(5 missing values generated)
(180 missing values generated)
(180 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(165 missing values generated)
(165 missing values generated)
(165 missing values generated)
(235 missing values generated)
(5 missing values generated)
(180 missing values generated)
(180 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(165 missing values generated)
(165 missing values generated)
(165 missing values generated)
(235 missing values generated)
(5 missing values generated)
(180 missing values generated)
(180 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(180 missing values generated)
(165 missing values generated)
(165 missing values generated)
(165 missing values generated)
(235 missing values generated)
(5 missing values generated)
(180 missing values generated)
(180 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)
(10 missing values generated)

.  
. *Loop for Wahlkreis 
.  
. forval x=1/35{ 
  2. gen wkr`x'=1 if wkr==`x' 
  3. replace wkr`x'=0 if wkr!=`x' 
  4. } 
(4,910 missing values generated)
(4,910 real changes made)
(5,115 missing values generated)
(5,115 real changes made)
(5,120 missing values generated)
(5,120 real changes made)
(5,030 missing values generated)
(5,030 real changes made)
(4,960 missing values generated)
(4,960 real changes made)
(4,945 missing values generated)
(4,945 real changes made)
(4,980 missing values generated)
(4,980 real changes made)
(5,005 missing values generated)
(5,005 real changes made)
(5,010 missing values generated)
(5,010 real changes made)
(5,005 missing values generated)
(5,005 real changes made)
(4,995 missing values generated)
(4,995 real changes made)
(4,925 missing values generated)
(4,925 real changes made)
(5,000 missing values generated)
(5,000 real changes made)
(4,935 missing values generated)
(4,935 real changes made)
(4,955 missing values generated)
(4,955 real changes made)
(4,930 missing values generated)
(4,930 real changes made)
(4,955 missing values generated)
(4,955 real changes made)
(4,970 missing values generated)
(4,970 real changes made)
(4,915 missing values generated)
(4,915 real changes made)
(5,015 missing values generated)
(5,015 real changes made)
(5,005 missing values generated)
(5,005 real changes made)
(5,055 missing values generated)
(5,055 real changes made)
(5,030 missing values generated)
(5,030 real changes made)
(4,800 missing values generated)
(4,800 real changes made)
(4,865 missing values generated)
(4,865 real changes made)
(4,705 missing values generated)
(4,705 real changes made)
(5,005 missing values generated)
(5,005 real changes made)
(5,025 missing values generated)
(5,025 real changes made)
(5,075 missing values generated)
(5,075 real changes made)
(5,015 missing values generated)
(5,015 real changes made)
(4,800 missing values generated)
(4,800 real changes made)
(4,925 missing values generated)
(4,925 real changes made)
(5,010 missing values generated)
(5,010 real changes made)
(5,115 missing values generated)
(5,115 real changes made)
(4,975 missing values generated)
(4,975 real changes made)

.  
. *Generate local fixed effects for Wahlkreis 
. forval x=1/35{ 
  2.  
. gen wkr`x'_1928=wkr`x'*yeardum1 
  3. gen wkr`x'_1930=wkr`x'*yeardum2 
  4. gen wkr`x'_1932_jul=wkr`x'*yeardum3 
  5. gen wkr`x'_1932_nov=wkr`x'*yeardum4 
  6. gen wkr`x'_1933=wkr`x'*yeardum5 
  7. } 

.  
.  
. *Tell Stata that this is panel data 
. xtset id yearDes 
       panel variable:  id (strongly balanced)
        time variable:  yearDes, 4 to 8
                delta:  1 unit

.  
. *Column 1 regression 
.  
. xtreg Nazi_share ss /* 
> */ pop_2 pop_3 pop_4 pop_2_2 pop_2_3 pop_2_4 pop_3_2 pop_3_3 pop_3_4 pop_4_2 pop_4_3 pop_4_4 pop_5_2 pop_5_3 pop_5_4/* 
> */ jewishpop2 jewishpop3 jewishpop4 cathpop2 cathpop3 cathpop4 /* 
> */ bluecollar2 bluecollar3 bluecollar4 whitecollar2 whitecollar3 whitecollar4 warparticipant2 warparticipant3 warparticipant4 welf
> are2 welfare3 welfare4 socialrent2 socialrent3 socialrent4 /* 
> */ city2 city3 city4 proptax2 proptax3 proptax4 altitude2 altitude3 altitude4 unemployed2 unemployed3 unemployed4 partemploy2 part
> employ3 partemploy4 bigd2 bigd3 bigd4 /* 
> */ turnout2 turnout3 turnout4 dnvpshare2 dnvpshare3 dnvpshare4 nsfpshare2 nsfpshare3 nsfpshare4 spdshare2 spdshare3 spdshare4 zent
> rumshare2 zentrumshare3 zentrumshare4 /* 
> */ wkr*_1930 wkr*_1932_jul wkr*_1932_nov /* 
> */i.yearDes if yearDes==5|yearDes==6|yearDes==7, fe cluster(id) 
note: pop_3_4 omitted because of collinearity
note: pop_4_4 omitted because of collinearity
note: pop_5_4 omitted because of collinearity
note: jewishpop4 omitted because of collinearity
note: cathpop4 omitted because of collinearity
note: bluecollar4 omitted because of collinearity
note: whitecollar4 omitted because of collinearity
note: warparticipant4 omitted because of collinearity
note: welfare4 omitted because of collinearity
note: socialrent4 omitted because of collinearity
note: city4 omitted because of collinearity
note: proptax4 omitted because of collinearity
note: altitude4 omitted because of collinearity
note: unemployed4 omitted because of collinearity
note: partemploy4 omitted because of collinearity
note: bigd4 omitted because of collinearity
note: turnout4 omitted because of collinearity
note: dnvpshare4 omitted because of collinearity
note: nsfpshare4 omitted because of collinearity
note: spdshare4 omitted because of collinearity
note: zentrumshare4 omitted because of collinearity
note: wkr2_1930 omitted because of collinearity
note: wkr3_1930 omitted because of collinearity
note: wkr2_1932_jul omitted because of collinearity
note: wkr3_1932_jul omitted because of collinearity
note: wkr1_1932_nov omitted because of collinearity
note: wkr2_1932_nov omitted because of collinearity
note: wkr3_1932_nov omitted because of collinearity
note: wkr4_1932_nov omitted because of collinearity
note: wkr5_1932_nov omitted because of collinearity
note: wkr6_1932_nov omitted because of collinearity
note: wkr7_1932_nov omitted because of collinearity
note: wkr8_1932_nov omitted because of collinearity
note: wkr9_1932_nov omitted because of collinearity
note: wkr10_1932_nov omitted because of collinearity
note: wkr11_1932_nov omitted because of collinearity
note: wkr12_1932_nov omitted because of collinearity
note: wkr13_1932_nov omitted because of collinearity
note: wkr14_1932_nov omitted because of collinearity
note: wkr15_1932_nov omitted because of collinearity
note: wkr16_1932_nov omitted because of collinearity
note: wkr17_1932_nov omitted because of collinearity
note: wkr18_1932_nov omitted because of collinearity
note: wkr19_1932_nov omitted because of collinearity
note: wkr20_1932_nov omitted because of collinearity
note: wkr21_1932_nov omitted because of collinearity
note: wkr22_1932_nov omitted because of collinearity
note: wkr23_1932_nov omitted because of collinearity
note: wkr24_1932_nov omitted because of collinearity
note: wkr25_1932_nov omitted because of collinearity
note: wkr26_1932_nov omitted because of collinearity
note: wkr27_1932_nov omitted because of collinearity
note: wkr28_1932_nov omitted because of collinearity
note: wkr29_1932_nov omitted because of collinearity
note: wkr30_1932_nov omitted because of collinearity
note: wkr31_1932_nov omitted because of collinearity
note: wkr32_1932_nov omitted because of collinearity
note: wkr33_1932_nov omitted because of collinearity
note: wkr34_1932_nov omitted because of collinearity
note: wkr35_1932_nov omitted because of collinearity
note: 6.yearDes omitted because of collinearity
note: 7.yearDes omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      2,836
Group variable: id                              Number of groups  =        959

R-sq:                                           Obs per group:
     within  = 0.9390                                         min =          1
     between = 0.0047                                         avg =        3.0
     overall = 0.0240                                         max =          3

                                                F(111,958)        =          .
corr(u_i, Xb)  = -0.8701                        Prob > F          =          .

                                      (Std. Err. adjusted for 959 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
     Nazi_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
             ss |   -.079071   .0338421    -2.34   0.020    -.1454843   -.0126578
          pop_2 |  -.0556899   .0468141    -1.19   0.234    -.1475598    .0361801
          pop_3 |  -.0227316   .0416459    -0.55   0.585    -.1044592    .0589961
          pop_4 |  -.0218795    .041074    -0.53   0.594    -.1024849    .0587258
        pop_2_2 |   .0003805   .0002381     1.60   0.110    -.0000868    .0008478
        pop_2_3 |   .0000793   .0001581     0.50   0.616     -.000231    .0003895
        pop_2_4 |    .000057   .0001321     0.43   0.666    -.0002023    .0003163
        pop_3_2 |  -9.65e-07   5.24e-07    -1.84   0.066    -1.99e-06    6.31e-08
        pop_3_3 |  -7.45e-08   2.42e-07    -0.31   0.758    -5.49e-07    4.00e-07
        pop_3_4 |          0  (omitted)
        pop_4_2 |   9.59e-10   5.08e-10     1.89   0.059    -3.71e-11    1.96e-09
        pop_4_3 |   8.11e-11   2.31e-10     0.35   0.726    -3.72e-10    5.35e-10
        pop_4_4 |          0  (omitted)
        pop_5_2 |  -1.84e-13   9.68e-14    -1.90   0.058    -3.74e-13    6.21e-15
        pop_5_3 |  -1.59e-14   4.38e-14    -0.36   0.717    -1.02e-13    7.01e-14
        pop_5_4 |          0  (omitted)
     jewishpop2 |  -155.0739   39.77857    -3.90   0.000    -233.1371   -77.01072
     jewishpop3 |  -63.35509   18.67416    -3.39   0.001    -100.0021   -26.70811
     jewishpop4 |          0  (omitted)
       cathpop2 |    19.7357   1.992077     9.91   0.000     15.82637    23.64504
       cathpop3 |  -4.633955   .8715404    -5.32   0.000    -6.344303   -2.923606
       cathpop4 |          0  (omitted)
    bluecollar2 |   2.936927   2.496991     1.18   0.240    -1.963277    7.837131
    bluecollar3 |  -1.419304   1.084667    -1.31   0.191    -3.547901    .7092939
    bluecollar4 |          0  (omitted)
   whitecollar2 |   19.28419   5.171057     3.73   0.000     9.136282     29.4321
   whitecollar3 |    4.19221   2.429477     1.73   0.085    -.5755016    8.959921
   whitecollar4 |          0  (omitted)
warparticipant2 |  -.0612831   .0720783    -0.85   0.395    -.2027326    .0801665
warparticipant3 |  -.0695939   .0335448    -2.07   0.038    -.1354238   -.0037641
warparticipant4 |          0  (omitted)
       welfare2 |   .0285395   .0215461     1.32   0.186    -.0137435    .0708225
       welfare3 |   .0124961   .0107322     1.16   0.245    -.0085653    .0335575
       welfare4 |          0  (omitted)
    socialrent2 |   .0002992   .0591682     0.01   0.996    -.1158151    .1164135
    socialrent3 |   -.013494   .0286681    -0.47   0.638    -.0697535    .0427656
    socialrent4 |          0  (omitted)
          city2 |   .9039163   .8114482     1.11   0.266    -.6885049    2.496338
          city3 |   .0060942   .4030074     0.02   0.988    -.7847849    .7969733
          city4 |          0  (omitted)
       proptax2 |   .9220592   .3366184     2.74   0.006     .2614646    1.582654
       proptax3 |   .5900789   .1395604     4.23   0.000     .3161994    .8639584
       proptax4 |          0  (omitted)
      altitude2 |  -.0085037   .0016039    -5.30   0.000    -.0116512   -.0053562
      altitude3 |  -.0004479   .0008969    -0.50   0.618    -.0022081    .0013122
      altitude4 |          0  (omitted)
    unemployed2 |     22.707   8.663887     2.62   0.009     5.704613    39.70939
    unemployed3 |     2.0806   5.043399     0.41   0.680    -7.816785    11.97799
    unemployed4 |          0  (omitted)
    partemploy2 |  -10.02104    10.0198    -1.00   0.318    -29.68432    9.642238
    partemploy3 |   .2716763   4.391137     0.06   0.951    -8.345682    8.889035
    partemploy4 |          0  (omitted)
          bigd2 |  -.0682753   .2071146    -0.33   0.742     -.474726    .3381754
          bigd3 |  -.0859895   .0934356    -0.92   0.358    -.2693515    .0973725
          bigd4 |          0  (omitted)
       turnout2 |   5.057323   4.182439     1.21   0.227    -3.150477    13.26512
       turnout3 |  -.8614773   1.995999    -0.43   0.666    -4.778511    3.055557
       turnout4 |          0  (omitted)
     dnvpshare2 |   -7.82553   2.757945    -2.84   0.005    -13.23784    -2.41322
     dnvpshare3 |   1.409122   1.311891     1.07   0.283    -1.165389    3.983633
     dnvpshare4 |          0  (omitted)
     nsfpshare2 |   12.75119   8.801268     1.45   0.148    -4.520802    30.02318
     nsfpshare3 |  -.4343988   3.482554    -0.12   0.901    -7.268714    6.399917
     nsfpshare4 |          0  (omitted)
      spdshare2 |   12.42595   3.125809     3.98   0.000     6.291726    18.56017
      spdshare3 |  -6.277685    1.51983    -4.13   0.000    -9.260266   -3.295105
      spdshare4 |          0  (omitted)
  zentrumshare2 |  -3.344065   2.159355    -1.55   0.122    -7.581677    .8935474
  zentrumshare3 |  -.5588686   .9251919    -0.60   0.546    -2.374505    1.256768
  zentrumshare4 |          0  (omitted)
      wkr1_1930 |  -35.51443   5.268343    -6.74   0.000    -45.85326   -25.17561
      wkr2_1930 |          0  (omitted)
      wkr3_1930 |          0  (omitted)
      wkr4_1930 |  -32.15433   5.126292    -6.27   0.000    -42.21439   -22.09428
      wkr5_1930 |  -35.18894   5.139437    -6.85   0.000     -45.2748   -25.10309
      wkr6_1930 |  -30.91305   5.294318    -5.84   0.000    -41.30285   -20.52325
      wkr7_1930 |  -35.57477    5.28568    -6.73   0.000    -45.94762   -25.20192
      wkr8_1930 |   -38.1951   5.061341    -7.55   0.000     -48.1277   -28.26251
      wkr9_1930 |  -42.45689   4.806627    -8.83   0.000    -51.88962   -33.02415
     wkr10_1930 |  -38.94531   5.120354    -7.61   0.000    -48.99371   -28.89691
     wkr11_1930 |  -30.21448   5.269037    -5.73   0.000    -40.55466   -19.87429
     wkr12_1930 |  -33.70464   5.007486    -6.73   0.000    -43.53155   -23.87773
     wkr13_1930 |  -36.65419   5.112696    -7.17   0.000    -46.68756   -26.62081
     wkr14_1930 |   -29.8714   4.916341    -6.08   0.000    -39.51945   -20.22336
     wkr15_1930 |  -38.35073   4.944846    -7.76   0.000    -48.05471   -28.64675
     wkr16_1930 |  -34.95537   5.128634    -6.82   0.000    -45.02002   -24.89072
     wkr17_1930 |  -33.44097    5.07389    -6.59   0.000     -43.3982   -23.48375
     wkr18_1930 |  -33.16877   5.026311    -6.60   0.000    -43.03262   -23.30492
     wkr19_1930 |  -39.85675   4.980423    -8.00   0.000    -49.63055   -30.08296
     wkr20_1930 |   -31.5678   4.808884    -6.56   0.000    -41.00497   -22.13064
     wkr21_1930 |  -32.82609   4.833576    -6.79   0.000    -42.31171   -23.34047
     wkr22_1930 |  -31.57074   5.054113    -6.25   0.000    -41.48916   -21.65233
     wkr23_1930 |  -35.22446   5.014971    -7.02   0.000    -45.06606   -25.38286
     wkr24_1930 |  -36.88948   5.471215    -6.74   0.000    -47.62643   -26.15253
     wkr25_1930 |   -33.2321   5.263468    -6.31   0.000    -43.56135   -22.90284
     wkr26_1930 |   -36.8868   5.251704    -7.02   0.000    -47.19298   -26.58063
     wkr27_1930 |  -42.51244    4.74887    -8.95   0.000    -51.83183   -33.19305
     wkr28_1930 |  -36.25817   5.113371    -7.09   0.000    -46.29287   -26.22347
     wkr29_1930 |  -36.76642   5.166178    -7.12   0.000    -46.90476   -26.62809
     wkr30_1930 |  -35.99754   5.087463    -7.08   0.000     -45.9814   -26.01368
     wkr31_1930 |  -34.40325   4.844291    -7.10   0.000    -43.90989    -24.8966
     wkr32_1930 |  -38.09326   4.624539    -8.24   0.000    -47.16865   -29.01786
     wkr33_1930 |  -41.60567   4.961047    -8.39   0.000    -51.34144    -31.8699
     wkr34_1930 |  -262.3968   120.0123    -2.19   0.029    -497.9142   -26.87943
     wkr35_1930 |  -34.98931    5.26302    -6.65   0.000    -45.31769   -24.66093
  wkr1_1932_jul |   6.962074   2.287244     3.04   0.002     2.473486    11.45066
  wkr2_1932_jul |          0  (omitted)
  wkr3_1932_jul |          0  (omitted)
  wkr4_1932_jul |   4.413967   2.358572     1.87   0.062    -.2145977    9.042532
  wkr5_1932_jul |   5.367851   2.376771     2.26   0.024     .7035727    10.03213
  wkr6_1932_jul |   3.765353   2.418364     1.56   0.120    -.9805499    8.511256
  wkr7_1932_jul |   3.529838   2.485438     1.42   0.156    -1.347693     8.40737
  wkr8_1932_jul |   5.035299   2.376096     2.12   0.034     .3723458    9.698253
  wkr9_1932_jul |   4.556867   2.181692     2.09   0.037     .2754204    8.838314
 wkr10_1932_jul |   4.266883   2.399539     1.78   0.076    -.4420762    8.975841
 wkr11_1932_jul |   6.601132   2.360771     2.80   0.005     1.968253    11.23401
 wkr12_1932_jul |   5.891293   2.323044     2.54   0.011     1.332452    10.45014
 wkr13_1932_jul |    3.12038   2.343414     1.33   0.183    -1.478438    7.719198
 wkr14_1932_jul |   6.108572   2.140494     2.85   0.004     1.907974    10.30917
 wkr15_1932_jul |   6.631368   2.245961     2.95   0.003     2.223796    11.03894
 wkr16_1932_jul |   5.161428   2.583413     2.00   0.046     .0916261    10.23123
 wkr17_1932_jul |   4.939697   2.315531     2.13   0.033     .3955984    9.483795
 wkr18_1932_jul |   3.851259   2.320385     1.66   0.097    -.7023653    8.404883
 wkr19_1932_jul |   2.099353   2.337204     0.90   0.369    -2.487277    6.685983
 wkr20_1932_jul |   4.549521   2.258147     2.01   0.044     .1180353    8.981007
 wkr21_1932_jul |   6.023583   2.242796     2.69   0.007     1.622223    10.42494
 wkr22_1932_jul |   4.623634    2.32119     1.99   0.047     .0684307    9.178837
 wkr23_1932_jul |   4.412277   2.240574     1.97   0.049     .0152766    8.809277
 wkr24_1932_jul |   4.333403   2.473526     1.75   0.080    -.5207526    9.187558
 wkr25_1932_jul |   5.385969   2.368766     2.27   0.023     .7373999    10.03454
 wkr26_1932_jul |   4.836608   2.381496     2.03   0.043     .1630577    9.510158
 wkr27_1932_jul |   3.224682   2.208326     1.46   0.145    -1.109032    7.558396
 wkr28_1932_jul |   5.257209   2.408987     2.18   0.029     .5297087    9.984709
 wkr29_1932_jul |   5.002759    2.39656     2.09   0.037     .2996455    9.705872
 wkr30_1932_jul |   3.018669   2.375901     1.27   0.204    -1.643902    7.681241
 wkr31_1932_jul |   5.038644   2.190131     2.30   0.022     .7406349    9.336652
 wkr32_1932_jul |   4.745955   2.138974     2.22   0.027     .5483399    8.943571
 wkr33_1932_jul |   3.619755   2.221095     1.63   0.103    -.7390175    7.978528
 wkr34_1932_jul |  -19.70133   51.55587    -0.38   0.702    -120.8768    81.47414
 wkr35_1932_jul |   7.697141   2.339131     3.29   0.001     3.106729    12.28755
  wkr1_1932_nov |          0  (omitted)
  wkr2_1932_nov |          0  (omitted)
  wkr3_1932_nov |          0  (omitted)
  wkr4_1932_nov |          0  (omitted)
  wkr5_1932_nov |          0  (omitted)
  wkr6_1932_nov |          0  (omitted)
  wkr7_1932_nov |          0  (omitted)
  wkr8_1932_nov |          0  (omitted)
  wkr9_1932_nov |          0  (omitted)
 wkr10_1932_nov |          0  (omitted)
 wkr11_1932_nov |          0  (omitted)
 wkr12_1932_nov |          0  (omitted)
 wkr13_1932_nov |          0  (omitted)
 wkr14_1932_nov |          0  (omitted)
 wkr15_1932_nov |          0  (omitted)
 wkr16_1932_nov |          0  (omitted)
 wkr17_1932_nov |          0  (omitted)
 wkr18_1932_nov |          0  (omitted)
 wkr19_1932_nov |          0  (omitted)
 wkr20_1932_nov |          0  (omitted)
 wkr21_1932_nov |          0  (omitted)
 wkr22_1932_nov |          0  (omitted)
 wkr23_1932_nov |          0  (omitted)
 wkr24_1932_nov |          0  (omitted)
 wkr25_1932_nov |          0  (omitted)
 wkr26_1932_nov |          0  (omitted)
 wkr27_1932_nov |          0  (omitted)
 wkr28_1932_nov |          0  (omitted)
 wkr29_1932_nov |          0  (omitted)
 wkr30_1932_nov |          0  (omitted)
 wkr31_1932_nov |          0  (omitted)
 wkr32_1932_nov |          0  (omitted)
 wkr33_1932_nov |          0  (omitted)
 wkr34_1932_nov |          0  (omitted)
 wkr35_1932_nov |          0  (omitted)
                |
        yearDes |
          n327  |          0  (omitted)
          n32n  |          0  (omitted)
                |
          _cons |   36.34934   1.349369    26.94   0.000     33.70128     38.9974
----------------+----------------------------------------------------------------
        sigma_u |  30.416068
        sigma_e |  3.0928695
            rho |   .9897659   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

.  
. *install outreg2
. ssc install outreg2
checking outreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. 
. *Table for column 1 
. outreg2 Nazi_share ss estimates save "Table3_replica.doc" using "Table3_replica.doc", title(RADIO AVAILABILITY AND VOTING FOR THE 
> NAZIS: DISTRICT FIXED EFFECTS) replace ctitle("", Nazi Vote Share,"",September 1930 July 1932 and November 1932,"", Panel: OLS) ke
> ep(ss) addtext (Baseline controls interacted with time fixed effects, Yes, Baseline controls, No, District fixed effects, Yes, Tim
> e fixed effects, Yes) 
Table3_replica.doc
dir : seeout

.  
. *Regression for Column 2 
.  
. xtreg Nazi_share ss_nl /* 
> */ pop_2 pop_3 pop_4 pop_2_2 pop_2_3 pop_2_4 pop_3_2 pop_3_3 pop_3_4 pop_4_2 pop_4_3 pop_4_4 pop_5_2 pop_5_3 pop_5_4/* 
> */ jewishpop2 jewishpop3 jewishpop4 cathpop2 cathpop3 cathpop4 /* 
> */ bluecollar2 bluecollar3 bluecollar4 whitecollar2 whitecollar3 whitecollar4 warparticipant2 warparticipant3 warparticipant4 welf
> are2 welfare3 welfare4 socialrent2 socialrent3 socialrent4 /* 
> */ city2 city3 city4 proptax2 proptax3 proptax4 altitude2 altitude3 altitude4 unemployed2 unemployed3 unemployed4 partemploy2 part
> employ3 partemploy4 bigd2 bigd3 bigd4 /* 
> */ turnout2 turnout3 turnout4 dnvpshare2 dnvpshare3 dnvpshare4 nsfpshare2 nsfpshare3 nsfpshare4 spdshare2 spdshare3 spdshare4 zent
> rumshare2 zentrumshare3 zentrumshare4 /* 
> */ wkr*_1930 wkr*_1932_jul wkr*_1932_nov /* 
> */i.yearDes if yearDes==5|yearDes==6|yearDes==7, fe cluster(id) 
note: pop_3_4 omitted because of collinearity
note: pop_4_4 omitted because of collinearity
note: pop_5_4 omitted because of collinearity
note: jewishpop4 omitted because of collinearity
note: cathpop4 omitted because of collinearity
note: bluecollar4 omitted because of collinearity
note: whitecollar4 omitted because of collinearity
note: warparticipant4 omitted because of collinearity
note: welfare4 omitted because of collinearity
note: socialrent4 omitted because of collinearity
note: city4 omitted because of collinearity
note: proptax4 omitted because of collinearity
note: altitude4 omitted because of collinearity
note: unemployed4 omitted because of collinearity
note: partemploy4 omitted because of collinearity
note: bigd4 omitted because of collinearity
note: turnout4 omitted because of collinearity
note: dnvpshare4 omitted because of collinearity
note: nsfpshare4 omitted because of collinearity
note: spdshare4 omitted because of collinearity
note: zentrumshare4 omitted because of collinearity
note: wkr2_1930 omitted because of collinearity
note: wkr3_1930 omitted because of collinearity
note: wkr2_1932_jul omitted because of collinearity
note: wkr3_1932_jul omitted because of collinearity
note: wkr1_1932_nov omitted because of collinearity
note: wkr2_1932_nov omitted because of collinearity
note: wkr3_1932_nov omitted because of collinearity
note: wkr4_1932_nov omitted because of collinearity
note: wkr5_1932_nov omitted because of collinearity
note: wkr6_1932_nov omitted because of collinearity
note: wkr7_1932_nov omitted because of collinearity
note: wkr8_1932_nov omitted because of collinearity
note: wkr9_1932_nov omitted because of collinearity
note: wkr10_1932_nov omitted because of collinearity
note: wkr11_1932_nov omitted because of collinearity
note: wkr12_1932_nov omitted because of collinearity
note: wkr13_1932_nov omitted because of collinearity
note: wkr14_1932_nov omitted because of collinearity
note: wkr15_1932_nov omitted because of collinearity
note: wkr16_1932_nov omitted because of collinearity
note: wkr17_1932_nov omitted because of collinearity
note: wkr18_1932_nov omitted because of collinearity
note: wkr19_1932_nov omitted because of collinearity
note: wkr20_1932_nov omitted because of collinearity
note: wkr21_1932_nov omitted because of collinearity
note: wkr22_1932_nov omitted because of collinearity
note: wkr23_1932_nov omitted because of collinearity
note: wkr24_1932_nov omitted because of collinearity
note: wkr25_1932_nov omitted because of collinearity
note: wkr26_1932_nov omitted because of collinearity
note: wkr27_1932_nov omitted because of collinearity
note: wkr28_1932_nov omitted because of collinearity
note: wkr29_1932_nov omitted because of collinearity
note: wkr30_1932_nov omitted because of collinearity
note: wkr31_1932_nov omitted because of collinearity
note: wkr32_1932_nov omitted because of collinearity
note: wkr33_1932_nov omitted because of collinearity
note: wkr34_1932_nov omitted because of collinearity
note: wkr35_1932_nov omitted because of collinearity
note: 6.yearDes omitted because of collinearity
note: 7.yearDes omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      2,836
Group variable: id                              Number of groups  =        959

R-sq:                                           Obs per group:
     within  = 0.9391                                         min =          1
     between = 0.0041                                         avg =        3.0
     overall = 0.0169                                         max =          3

                                                F(111,958)        =          .
corr(u_i, Xb)  = -0.9016                        Prob > F          =          .

                                      (Std. Err. adjusted for 959 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
     Nazi_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
          ss_nl |  -.2273156    .088518    -2.57   0.010    -.4010271    -.053604
          pop_2 |  -.0584296    .046724    -1.25   0.211    -.1501229    .0332637
          pop_3 |  -.0246429   .0414277    -0.59   0.552    -.1059424    .0566566
          pop_4 |  -.0235093   .0408326    -0.58   0.565    -.1036408    .0566223
        pop_2_2 |   .0004031   .0002394     1.68   0.093    -.0000668    .0008729
        pop_2_3 |   .0000912   .0001579     0.58   0.564    -.0002186    .0004011
        pop_2_4 |   .0000664   .0001311     0.51   0.612    -.0001908    .0003237
        pop_3_2 |  -9.93e-07   5.32e-07    -1.87   0.062    -2.04e-06    5.13e-08
        pop_3_3 |  -7.43e-08   2.49e-07    -0.30   0.765    -5.62e-07    4.13e-07
        pop_3_4 |          0  (omitted)
        pop_4_2 |   9.78e-10   5.18e-10     1.89   0.059    -3.86e-11    1.99e-09
        pop_4_3 |   7.51e-11   2.38e-10     0.31   0.753    -3.93e-10    5.43e-10
        pop_4_4 |          0  (omitted)
        pop_5_2 |  -1.87e-13   9.88e-14    -1.89   0.059    -3.80e-13    7.14e-15
        pop_5_3 |  -1.44e-14   4.53e-14    -0.32   0.750    -1.03e-13    7.44e-14
        pop_5_4 |          0  (omitted)
     jewishpop2 |  -151.6292   40.20378    -3.77   0.000    -230.5268   -72.73153
     jewishpop3 |  -61.78321   18.76874    -3.29   0.001     -98.6158   -24.95063
     jewishpop4 |          0  (omitted)
       cathpop2 |   19.55517   2.000517     9.78   0.000     15.62927    23.48107
       cathpop3 |  -4.645986   .8784596    -5.29   0.000    -6.369913   -2.922059
       cathpop4 |          0  (omitted)
    bluecollar2 |   3.247945   2.528394     1.28   0.199    -1.713885    8.209775
    bluecollar3 |  -1.175491    1.09262    -1.08   0.282    -3.319696    .9687142
    bluecollar4 |          0  (omitted)
   whitecollar2 |   18.72582   5.169708     3.62   0.000      8.58056    28.87108
   whitecollar3 |   4.070243   2.423806     1.68   0.093    -.6863391    8.826825
   whitecollar4 |          0  (omitted)
warparticipant2 |  -.0567703   .0729552    -0.78   0.437    -.1999408    .0864002
warparticipant3 |  -.0676762    .033482    -2.02   0.044    -.1333827   -.0019697
warparticipant4 |          0  (omitted)
       welfare2 |     .02852   .0215657     1.32   0.186    -.0138015    .0708415
       welfare3 |   .0123898   .0106278     1.17   0.244    -.0084666    .0332463
       welfare4 |          0  (omitted)
    socialrent2 |  -.0010404   .0595998    -0.02   0.986    -.1180017    .1159208
    socialrent3 |  -.0142093   .0286923    -0.50   0.621    -.0705164    .0420978
    socialrent4 |          0  (omitted)
          city2 |   .9483239   .8116383     1.17   0.243    -.6444702    2.541118
          city3 |   .0007119   .4032889     0.00   0.999    -.7907196    .7921435
          city4 |          0  (omitted)
       proptax2 |   .8740121   .3383775     2.58   0.010     .2099655    1.538059
       proptax3 |   .5760393   .1397774     4.12   0.000      .301734    .8503445
       proptax4 |          0  (omitted)
      altitude2 |  -.0086518   .0016121    -5.37   0.000    -.0118154   -.0054882
      altitude3 |   -.000442    .000896    -0.49   0.622    -.0022004    .0013164
      altitude4 |          0  (omitted)
    unemployed2 |   23.56902   8.638908     2.73   0.006     6.615649    40.52238
    unemployed3 |   2.627503   5.022584     0.52   0.601    -7.229033    12.48404
    unemployed4 |          0  (omitted)
    partemploy2 |  -9.786454   10.00575    -0.98   0.328    -29.42217    9.849266
    partemploy3 |   .6428228   4.406857     0.15   0.884    -8.005384    9.291029
    partemploy4 |          0  (omitted)
          bigd2 |  -.1365256    .208796    -0.65   0.513     -.546276    .2732248
          bigd3 |  -.0885783   .0930799    -0.95   0.342    -.2712423    .0940857
          bigd4 |          0  (omitted)
       turnout2 |   5.519788   4.196979     1.32   0.189    -2.716545    13.75612
       turnout3 |  -.6412921   2.009311    -0.32   0.750    -4.584451    3.301867
       turnout4 |          0  (omitted)
     dnvpshare2 |  -7.695103   2.757425    -2.79   0.005    -13.10639   -2.283813
     dnvpshare3 |   1.577818   1.315968     1.20   0.231    -1.004694     4.16033
     dnvpshare4 |          0  (omitted)
     nsfpshare2 |    11.3945   8.872671     1.28   0.199    -6.017618    28.80661
     nsfpshare3 |  -.8777908   3.498591    -0.25   0.802    -7.743578    5.987997
     nsfpshare4 |          0  (omitted)
      spdshare2 |   12.05983   3.130616     3.85   0.000     5.916169    18.20348
      spdshare3 |  -6.584906   1.531492    -4.30   0.000    -9.590373   -3.579439
      spdshare4 |          0  (omitted)
  zentrumshare2 |  -3.218066   2.153349    -1.49   0.135    -7.443892     1.00776
  zentrumshare3 |  -.5968627   .9370274    -0.64   0.524    -2.435726       1.242
  zentrumshare4 |          0  (omitted)
      wkr1_1930 |  -33.05168    5.06349    -6.53   0.000     -42.9885   -23.11487
      wkr2_1930 |          0  (omitted)
      wkr3_1930 |          0  (omitted)
      wkr4_1930 |  -31.67276   5.132616    -6.17   0.000    -41.74523   -21.60029
      wkr5_1930 |  -34.98377   5.138938    -6.81   0.000    -45.06864   -24.89889
      wkr6_1930 |  -30.95322   5.286036    -5.86   0.000    -41.32676   -20.57967
      wkr7_1930 |  -34.99834   5.273489    -6.64   0.000    -45.34726   -24.64942
      wkr8_1930 |  -37.83916   5.058405    -7.48   0.000    -47.76599   -27.91232
      wkr9_1930 |  -41.89952   4.816196    -8.70   0.000    -51.35103     -32.448
     wkr10_1930 |  -38.91799   5.119723    -7.60   0.000    -48.96516   -28.87083
     wkr11_1930 |  -30.20667   5.253789    -5.75   0.000    -40.51693   -19.89641
     wkr12_1930 |  -33.89886   5.001937    -6.78   0.000    -43.71488   -24.08285
     wkr13_1930 |  -36.57505   5.105923    -7.16   0.000    -46.59513   -26.55497
     wkr14_1930 |  -29.88668   4.908473    -6.09   0.000    -39.51928   -20.25408
     wkr15_1930 |  -38.46276   4.934928    -7.79   0.000    -48.14728   -28.77824
     wkr16_1930 |  -34.95191   5.128325    -6.82   0.000    -45.01596   -24.88786
     wkr17_1930 |  -33.19983    5.06264    -6.56   0.000    -43.13498   -23.26469
     wkr18_1930 |   -32.5583   5.025617    -6.48   0.000    -42.42078   -22.69581
     wkr19_1930 |  -39.57532   4.974262    -7.96   0.000    -49.33703   -29.81361
     wkr20_1930 |  -30.91913   4.810103    -6.43   0.000    -40.35868   -21.47957
     wkr21_1930 |  -32.60296   4.833217    -6.75   0.000    -42.08788   -23.11805
     wkr22_1930 |  -31.08216   5.056423    -6.15   0.000     -41.0051   -21.15922
     wkr23_1930 |  -34.64317   5.005675    -6.92   0.000    -44.46652   -24.81981
     wkr24_1930 |  -36.48844   5.484295    -6.65   0.000    -47.25106   -25.72582
     wkr25_1930 |  -33.19955    5.26787    -6.30   0.000    -43.53744   -22.86165
     wkr26_1930 |  -36.50479   5.255582    -6.95   0.000    -46.81857   -26.19101
     wkr27_1930 |  -41.95726   4.740898    -8.85   0.000      -51.261   -32.65352
     wkr28_1930 |  -36.09112   5.114744    -7.06   0.000    -46.12852   -26.05372
     wkr29_1930 |  -36.77722   5.157511    -7.13   0.000    -46.89855    -26.6559
     wkr30_1930 |  -36.29667   5.087437    -7.13   0.000    -46.28047   -26.31286
     wkr31_1930 |  -33.72721   4.826967    -6.99   0.000    -43.19986   -24.25456
     wkr32_1930 |  -37.49302   4.621239    -8.11   0.000    -46.56194    -28.4241
     wkr33_1930 |  -41.24956   4.962594    -8.31   0.000    -50.98837   -31.51075
     wkr34_1930 |  -261.0067   123.0468    -2.12   0.034     -502.479   -19.53446
     wkr35_1930 |  -34.93914   5.267349    -6.63   0.000    -45.27602   -24.60227
  wkr1_1932_jul |   6.895801   2.293652     3.01   0.003     2.394639    11.39696
  wkr2_1932_jul |          0  (omitted)
  wkr3_1932_jul |          0  (omitted)
  wkr4_1932_jul |    4.40213   2.370164     1.86   0.064    -.2491825    9.053443
  wkr5_1932_jul |   5.270291   2.383583     2.21   0.027     .5926435    9.947938
  wkr6_1932_jul |   3.452062   2.428366     1.42   0.155    -1.313468    8.217592
  wkr7_1932_jul |     3.8405   2.474325     1.55   0.121    -1.015222    8.696223
  wkr8_1932_jul |   5.282619   2.367277     2.23   0.026     .6369718    9.928265
  wkr9_1932_jul |   4.651158    2.18885     2.12   0.034     .3556642    8.946653
 wkr10_1932_jul |   4.036077   2.409507     1.68   0.094    -.6924433    8.764598
 wkr11_1932_jul |   6.187575   2.366302     2.61   0.009     1.543841    10.83131
 wkr12_1932_jul |    5.51408   2.328651     2.37   0.018     .9442335    10.08393
 wkr13_1932_jul |   2.960328   2.356195     1.26   0.209    -1.663571    7.584228
 wkr14_1932_jul |   5.892962   2.148309     2.74   0.006     1.677027     10.1089
 wkr15_1932_jul |   6.390125   2.252949     2.84   0.005      1.96884    10.81141
 wkr16_1932_jul |   4.981628   2.590061     1.92   0.055    -.1012204    10.06448
 wkr17_1932_jul |    4.89171   2.325359     2.10   0.036     .3283246    9.455095
 wkr18_1932_jul |   3.898981   2.328228     1.67   0.094     -.670035    8.467997
 wkr19_1932_jul |   2.002599   2.341965     0.86   0.393    -2.593375    6.598572
 wkr20_1932_jul |   4.702131   2.268958     2.07   0.038     .2494297    9.154832
 wkr21_1932_jul |   5.899783   2.257179     2.61   0.009     1.470197    10.32937
 wkr22_1932_jul |   4.288221   2.321928     1.85   0.065    -.2684313    8.844874
 wkr23_1932_jul |   4.489374   2.260432     1.99   0.047      .053404    8.925344
 wkr24_1932_jul |   4.187207   2.482912     1.69   0.092    -.6853666    9.059781
 wkr25_1932_jul |   5.177544   2.376957     2.18   0.030     .5129002    9.842188
 wkr26_1932_jul |   4.715161   2.389718     1.97   0.049     .0254746    9.404847
 wkr27_1932_jul |   3.354554   2.216789     1.51   0.131    -.9957688    7.704876
 wkr28_1932_jul |   5.041986   2.417428     2.09   0.037     .2979213     9.78605
 wkr29_1932_jul |   4.608779   2.395432     1.92   0.055    -.0921199    9.309678
 wkr30_1932_jul |   2.587232   2.383169     1.09   0.278    -2.089601    7.264065
 wkr31_1932_jul |    5.12953   2.201206     2.33   0.020     .8097871    9.449272
 wkr32_1932_jul |   4.811883   2.153715     2.23   0.026     .5853395    9.038426
 wkr33_1932_jul |   3.587991   2.230045     1.61   0.108    -.7883452    7.964327
 wkr34_1932_jul |  -16.07525   53.30269    -0.30   0.763    -120.6788    88.52826
 wkr35_1932_jul |   7.494596   2.349768     3.19   0.001      2.88331    12.10588
  wkr1_1932_nov |          0  (omitted)
  wkr2_1932_nov |          0  (omitted)
  wkr3_1932_nov |          0  (omitted)
  wkr4_1932_nov |          0  (omitted)
  wkr5_1932_nov |          0  (omitted)
  wkr6_1932_nov |          0  (omitted)
  wkr7_1932_nov |          0  (omitted)
  wkr8_1932_nov |          0  (omitted)
  wkr9_1932_nov |          0  (omitted)
 wkr10_1932_nov |          0  (omitted)
 wkr11_1932_nov |          0  (omitted)
 wkr12_1932_nov |          0  (omitted)
 wkr13_1932_nov |          0  (omitted)
 wkr14_1932_nov |          0  (omitted)
 wkr15_1932_nov |          0  (omitted)
 wkr16_1932_nov |          0  (omitted)
 wkr17_1932_nov |          0  (omitted)
 wkr18_1932_nov |          0  (omitted)
 wkr19_1932_nov |          0  (omitted)
 wkr20_1932_nov |          0  (omitted)
 wkr21_1932_nov |          0  (omitted)
 wkr22_1932_nov |          0  (omitted)
 wkr23_1932_nov |          0  (omitted)
 wkr24_1932_nov |          0  (omitted)
 wkr25_1932_nov |          0  (omitted)
 wkr26_1932_nov |          0  (omitted)
 wkr27_1932_nov |          0  (omitted)
 wkr28_1932_nov |          0  (omitted)
 wkr29_1932_nov |          0  (omitted)
 wkr30_1932_nov |          0  (omitted)
 wkr31_1932_nov |          0  (omitted)
 wkr32_1932_nov |          0  (omitted)
 wkr33_1932_nov |          0  (omitted)
 wkr34_1932_nov |          0  (omitted)
 wkr35_1932_nov |          0  (omitted)
                |
        yearDes |
          n327  |          0  (omitted)
          n32n  |          0  (omitted)
                |
          _cons |   39.85003   2.207674    18.05   0.000      35.5176    44.18247
----------------+----------------------------------------------------------------
        sigma_u |  34.770466
        sigma_e |  3.0914878
            rho |  .99215678   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

.  
. *Table for column 2 
. outreg2 Nazi_share ss_nl est save "Table3_replica.doc" using "Table3_replica.doc", append ctitle( Panel: OLS) keep(ss_nl) addtext 
> (Baseline controls interacted with time fixed effects, Yes, Baseline controls, No, District fixed effects, Yes, Time fixed effects
> , Yes) 
Table3_replica.doc
dir : seeout

.  
. *Regression for column 3 
.  
. xtreg Nazi_share ss_artf /* 
> */ pop_1 pop_2 pop_3 pop_4 pop_5 pop_2_1 pop_2_2 pop_2_3 pop_2_4 pop_2_5 pop_3_1 pop_3_2 pop_3_3 pop_3_4 pop_3_5 pop_4_1 pop_4_2 p
> op_4_3 pop_4_4 pop_4_5 pop_5_1 pop_5_2 pop_5_3 pop_5_4 pop_5_5/* Socio-economic and geographical factors 
> */ jewishpop1 jewishpop2 jewishpop3 jewishpop4 jewishpop5 cathpop1 cathpop2 cathpop3 cathpop4 cathpop5 bluecollar1 bluecollar2 blu
> ecollar3 bluecollar4 bluecollar5 whitecollar1 whitecollar2 whitecollar3 whitecollar4 whitecollar5 city1 city2 city3 city4 city5 wa
> rparticipant1 warparticipant2 warparticipant3 warparticipant4 warparticipant5 welfare1 welfare2 welfare3 welfare4 welfare5 socialr
> ent1 socialrent2 socialrent3 socialrent4 socialrent5 proptax1 proptax2 proptax3 proptax4 proptax5 altitude1 altitude2 altitude3 al
> titude4 altitude5 unemployed1 unemployed2 unemployed3 unemployed4 unemployed5 partemploy1 partemploy2 partemploy3 partemploy4 part
> employ5 bigd1 bigd2 bigd3 bigd4 bigd5 /* 
> */ turnout1 turnout2 turnout3 turnout4 turnout5 dnvpshare1 dnvpshare2 dnvpshare3 dnvpshare4 dnvpshare5 nsfpshare1 nsfpshare2 nsfps
> hare3 nsfpshare4 nsfpshare5 spdshare1 spdshare2 spdshare3 spdshare4 spdshare5 zentrumshare1 zentrumshare2 zentrumshare3 zentrumsha
> re4 zentrumshare5 /* 
> */ wkr*_* /*  
> */ i.yearDes, fe cluster(id) 
note: pop_4_5 omitted because of collinearity
note: pop_5_5 omitted because of collinearity
note: jewishpop5 omitted because of collinearity
note: cathpop5 omitted because of collinearity
note: bluecollar5 omitted because of collinearity
note: whitecollar5 omitted because of collinearity
note: city5 omitted because of collinearity
note: warparticipant5 omitted because of collinearity
note: welfare5 omitted because of collinearity
note: socialrent5 omitted because of collinearity
note: proptax5 omitted because of collinearity
note: altitude5 omitted because of collinearity
note: unemployed5 omitted because of collinearity
note: partemploy5 omitted because of collinearity
note: bigd5 omitted because of collinearity
note: turnout5 omitted because of collinearity
note: dnvpshare5 omitted because of collinearity
note: nsfpshare5 omitted because of collinearity
note: spdshare5 omitted because of collinearity
note: zentrumshare5 omitted because of collinearity
note: wkr1_1933 omitted because of collinearity
note: wkr2_1928 omitted because of collinearity
note: wkr2_1930 omitted because of collinearity
note: wkr2_1932_jul omitted because of collinearity
note: wkr2_1932_nov omitted because of collinearity
note: wkr2_1933 omitted because of collinearity
note: wkr3_1928 omitted because of collinearity
note: wkr3_1930 omitted because of collinearity
note: wkr3_1932_jul omitted because of collinearity
note: wkr3_1932_nov omitted because of collinearity
note: wkr3_1933 omitted because of collinearity
note: wkr4_1933 omitted because of collinearity
note: wkr5_1933 omitted because of collinearity
note: wkr6_1933 omitted because of collinearity
note: wkr7_1933 omitted because of collinearity
note: wkr8_1933 omitted because of collinearity
note: wkr9_1933 omitted because of collinearity
note: wkr10_1933 omitted because of collinearity
note: wkr11_1933 omitted because of collinearity
note: wkr12_1933 omitted because of collinearity
note: wkr13_1933 omitted because of collinearity
note: wkr14_1933 omitted because of collinearity
note: wkr15_1933 omitted because of collinearity
note: wkr16_1933 omitted because of collinearity
note: wkr17_1933 omitted because of collinearity
note: wkr18_1933 omitted because of collinearity
note: wkr19_1933 omitted because of collinearity
note: wkr20_1933 omitted because of collinearity
note: wkr21_1933 omitted because of collinearity
note: wkr22_1933 omitted because of collinearity
note: wkr23_1933 omitted because of collinearity
note: wkr24_1933 omitted because of collinearity
note: wkr25_1933 omitted because of collinearity
note: wkr26_1933 omitted because of collinearity
note: wkr27_1933 omitted because of collinearity
note: wkr28_1933 omitted because of collinearity
note: wkr29_1933 omitted because of collinearity
note: wkr30_1933 omitted because of collinearity
note: wkr31_1933 omitted because of collinearity
note: wkr32_1933 omitted because of collinearity
note: wkr33_1933 omitted because of collinearity
note: wkr34_1933 omitted because of collinearity
note: wkr35_1933 omitted because of collinearity
note: 5.yearDes omitted because of collinearity
note: 6.yearDes omitted because of collinearity
note: 7.yearDes omitted because of collinearity
note: 8.yearDes omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,713
Group variable: id                              Number of groups  =        959

R-sq:                                           Obs per group:
     within  = 0.9718                                         min =          2
     between = 0.0002                                         avg =        4.9
     overall = 0.0093                                         max =          5

                                                F(220,958)        =          .
corr(u_i, Xb)  = -0.9928                        Prob > F          =          .

                                      (Std. Err. adjusted for 959 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
     Nazi_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        ss_artf |   .0280355   .0071659     3.91   0.000     .0139728    .0420983
          pop_1 |  -.0182021   .0396825    -0.46   0.647    -.0960768    .0596726
          pop_2 |   -.044622   .0395302    -1.13   0.259    -.1221978    .0329537
          pop_3 |  -.0134529   .0337561    -0.40   0.690    -.0796973    .0527914
          pop_4 |  -.0115472   .0347624    -0.33   0.740    -.0797665     .056672
          pop_5 |  -.0192299   .0320264    -0.60   0.548    -.0820799    .0436201
        pop_2_1 |   .0002204   .0002366     0.93   0.352     -.000244    .0006847
        pop_2_2 |   .0003475   .0002292     1.52   0.130    -.0001023    .0007974
        pop_2_3 |   .0000637   .0001558     0.41   0.683     -.000242    .0003693
        pop_2_4 |   .0000363   .0001594     0.23   0.820    -.0002766    .0003492
        pop_2_5 |   .0000737   .0001129     0.65   0.514    -.0001478    .0002953
        pop_3_1 |  -6.35e-07   5.96e-07    -1.07   0.287    -1.80e-06    5.34e-07
        pop_3_2 |  -9.53e-07   5.63e-07    -1.69   0.091    -2.06e-06    1.52e-07
        pop_3_3 |  -1.19e-07   3.23e-07    -0.37   0.712    -7.53e-07    5.14e-07
        pop_3_4 |  -3.59e-08   3.32e-07    -0.11   0.914    -6.87e-07    6.15e-07
        pop_3_5 |  -9.24e-08   1.11e-07    -0.83   0.407    -3.11e-07    1.26e-07
        pop_4_1 |   5.77e-10   5.51e-10     1.05   0.296    -5.05e-10    1.66e-09
        pop_4_2 |   8.73e-10   5.16e-10     1.69   0.091    -1.39e-10    1.89e-09
        pop_4_3 |   5.70e-11   2.76e-10     0.21   0.836    -4.85e-10    5.99e-10
        pop_4_4 |  -2.98e-11   2.95e-10    -0.10   0.920    -6.09e-10    5.49e-10
        pop_4_5 |          0  (omitted)
        pop_5_1 |  -1.12e-13   1.05e-13    -1.07   0.287    -3.19e-13    9.44e-14
        pop_5_2 |  -1.68e-13   9.80e-14    -1.71   0.087    -3.60e-13    2.44e-14
        pop_5_3 |  -1.24e-14   5.20e-14    -0.24   0.812    -1.15e-13    8.98e-14
        pop_5_4 |   4.43e-15   5.57e-14     0.08   0.937    -1.05e-13    1.14e-13
        pop_5_5 |          0  (omitted)
     jewishpop1 |  -209.3208   41.15211    -5.09   0.000    -290.0795   -128.5621
     jewishpop2 |  -150.0276   39.59767    -3.79   0.000    -227.7358    -72.3194
     jewishpop3 |   -62.4447   28.71088    -2.17   0.030    -118.7882   -6.101232
     jewishpop4 |   5.327949   27.34635     0.19   0.846    -48.33771    58.99361
     jewishpop5 |          0  (omitted)
       cathpop1 |   21.52173   2.024568    10.63   0.000     17.54863    25.49483
       cathpop2 |   17.25099   2.146465     8.04   0.000     13.03867     21.4633
       cathpop3 |  -7.056854   1.206367    -5.85   0.000    -9.424281   -4.689427
       cathpop4 |  -2.404039   1.125753    -2.14   0.033    -4.613266   -.1948114
       cathpop5 |          0  (omitted)
    bluecollar1 |   11.31409   3.717347     3.04   0.002     4.019006    18.60917
    bluecollar2 |   5.358165   3.463522     1.55   0.122      -1.4388    12.15513
    bluecollar3 |    .950726    1.60466     0.59   0.554    -2.198327    4.099779
    bluecollar4 |   2.677939   1.653315     1.62   0.106    -.5665988    5.922476
    bluecollar5 |          0  (omitted)
   whitecollar1 |   20.32329    6.80683     2.99   0.003     6.965272    33.68131
   whitecollar2 |   27.86402   5.912095     4.71   0.000     16.26187    39.46617
   whitecollar3 |   12.99391   3.522334     3.69   0.000      6.08153    19.90629
   whitecollar4 |   8.692075    3.03305     2.87   0.004     2.739885    14.64426
   whitecollar5 |          0  (omitted)
          city1 |    .746273   .9336523     0.80   0.424    -1.085967    2.578513
          city2 |   .7178143   .9070169     0.79   0.429    -1.062155    2.497784
          city3 |  -.2474177   .5008229    -0.49   0.621    -1.230254    .7354189
          city4 |  -.2087559   .4536311    -0.46   0.645    -1.098981    .6814694
          city5 |          0  (omitted)
warparticipant1 |  -.0764177   .0890044    -0.86   0.391    -.2510837    .0982483
warparticipant2 |  -.0085771   .0841783    -0.10   0.919    -.1737723     .156618
warparticipant3 |   -.019495   .0514216    -0.38   0.705    -.1204069    .0814169
warparticipant4 |   .0492553   .0473578     1.04   0.299    -.0436816    .1421922
warparticipant5 |          0  (omitted)
       welfare1 |   .0329555   .0233395     1.41   0.158     -.012847     .078758
       welfare2 |   .0335111   .0242884     1.38   0.168    -.0141535    .0811757
       welfare3 |   .0178994   .0142733     1.25   0.210     -.010111    .0459099
       welfare4 |   .0046343   .0133746     0.35   0.729    -.0216125    .0308812
       welfare5 |          0  (omitted)
    socialrent1 |   .0789833   .0607564     1.30   0.194    -.0402477    .1982143
    socialrent2 |   .0314353   .0651777     0.48   0.630    -.0964722    .1593427
    socialrent3 |   .0189975   .0364656     0.52   0.603    -.0525643    .0905592
    socialrent4 |   .0406128   .0350236     1.16   0.247     -.028119    .1093446
    socialrent5 |          0  (omitted)
       proptax1 |   .5358505   .3458595     1.55   0.122    -.1428793     1.21458
       proptax2 |   .6917717   .3713726     1.86   0.063    -.0370259    1.420569
       proptax3 |   .3713683   .1875849     1.98   0.048     .0032435    .7394931
       proptax4 |  -.2232088   .1964457    -1.14   0.256    -.6087223    .1623048
       proptax5 |          0  (omitted)
      altitude1 |  -.0130819   .0018112    -7.22   0.000    -.0166362   -.0095275
      altitude2 |  -.0099388   .0018102    -5.49   0.000    -.0134913   -.0063864
      altitude3 |  -.0017358   .0010709    -1.62   0.105    -.0038375    .0003658
      altitude4 |  -.0012514   .0011391    -1.10   0.272    -.0034869    .0009841
      altitude5 |          0  (omitted)
    unemployed1 |   49.10814   10.08114     4.87   0.000     29.32446    68.89182
    unemployed2 |   42.16826   9.717993     4.34   0.000     23.09724    61.23927
    unemployed3 |   21.20961   6.218253     3.41   0.001     9.006642    33.41258
    unemployed4 |   18.13922   4.459615     4.07   0.000     9.387474    26.89096
    unemployed5 |          0  (omitted)
    partemploy1 |  -10.55543   9.594503    -1.10   0.272     -29.3841    8.273238
    partemploy2 |  -9.777121   11.05498    -0.88   0.377    -31.47189    11.91765
    partemploy3 |   .9466598   6.687756     0.14   0.887    -12.17768      14.071
    partemploy4 |  -.1019173   5.701187    -0.02   0.986    -11.29017    11.08634
    partemploy5 |          0  (omitted)
          bigd1 |    .372585   .2452949     1.52   0.129    -.1087924    .8539623
          bigd2 |   .1360066   .2295863     0.59   0.554    -.3145435    .5865567
          bigd3 |   .0787231    .125986     0.62   0.532    -.1685173    .3259636
          bigd4 |   .1525934   .1228368     1.24   0.214    -.0884668    .3936536
          bigd5 |          0  (omitted)
       turnout1 |   26.96522   4.461417     6.04   0.000     18.20994     35.7205
       turnout2 |   10.69557   4.928022     2.17   0.030     1.024604    20.36653
       turnout3 |   4.900915   2.868651     1.71   0.088    -.7286501    10.53048
       turnout4 |   6.005893   2.837838     2.12   0.035     .4367965    11.57499
       turnout5 |          0  (omitted)
     dnvpshare1 |  -20.30196   2.607471    -7.79   0.000    -25.41898   -15.18495
     dnvpshare2 |  -2.551557   2.861067    -0.89   0.373    -8.166239    3.063124
     dnvpshare3 |   6.771424   1.662749     4.07   0.000     3.508373    10.03448
     dnvpshare4 |   5.450941   1.419003     3.84   0.000     2.666227    8.235655
     dnvpshare5 |          0  (omitted)
     nsfpshare1 |   9.697566   8.679056     1.12   0.264    -7.334591    26.72972
     nsfpshare2 |   21.41267   8.963431     2.39   0.017      3.82244    39.00289
     nsfpshare3 |   9.022148    3.50234     2.58   0.010     2.149005    15.89529
     nsfpshare4 |   9.154222   3.745856     2.44   0.015     1.803191    16.50525
     nsfpshare5 |          0  (omitted)
      spdshare1 |   18.14907   3.314962     5.47   0.000     11.64365    24.65449
      spdshare2 |   20.76823   3.552455     5.85   0.000     13.79674    27.73972
      spdshare3 |    2.07938   1.962459     1.06   0.290    -1.771835    5.930594
      spdshare4 |   8.556038   1.888965     4.53   0.000     4.849051    12.26303
      spdshare5 |          0  (omitted)
  zentrumshare1 |   6.238356   2.411714     2.59   0.010     1.505505    10.97121
  zentrumshare2 |   .5917771   2.402725     0.25   0.806    -4.123434    5.306989
  zentrumshare3 |   3.278548   1.427095     2.30   0.022     .4779549    6.079141
  zentrumshare4 |   3.982795   1.370262     2.91   0.004     1.293735    6.671856
  zentrumshare5 |          0  (omitted)
      wkr1_1928 |  -92.73931   4.887882   -18.97   0.000    -102.3315   -83.14712
      wkr1_1930 |  -61.94768   5.658819   -10.95   0.000    -73.05279   -50.84257
  wkr1_1932_jul |  -21.63272   3.174291    -6.81   0.000    -27.86208   -15.40335
  wkr1_1932_nov |  -28.81894   3.149429    -9.15   0.000    -34.99952   -22.63837
      wkr1_1933 |          0  (omitted)
      wkr2_1928 |          0  (omitted)
      wkr2_1930 |          0  (omitted)
  wkr2_1932_jul |          0  (omitted)
  wkr2_1932_nov |          0  (omitted)
      wkr2_1933 |          0  (omitted)
      wkr3_1928 |          0  (omitted)
      wkr3_1930 |          0  (omitted)
  wkr3_1932_jul |          0  (omitted)
  wkr3_1932_nov |          0  (omitted)
      wkr3_1933 |          0  (omitted)
      wkr4_1928 |  -88.84003    5.09397   -17.44   0.000    -98.83665    -78.8434
      wkr4_1930 |  -56.77801   5.761315    -9.86   0.000    -68.08426   -45.47176
  wkr4_1932_jul |  -20.15169   3.249885    -6.20   0.000    -26.52941   -13.77398
  wkr4_1932_nov |  -24.79325   3.287251    -7.54   0.000     -31.2443   -18.34221
      wkr4_1933 |          0  (omitted)
      wkr5_1928 |  -94.02882   5.025385   -18.71   0.000    -103.8909   -84.16679
      wkr5_1930 |  -60.80406   5.771914   -10.53   0.000    -72.13112   -49.47701
  wkr5_1932_jul |  -20.16957   3.222631    -6.26   0.000    -26.49381   -13.84534
  wkr5_1932_nov |  -25.85777   3.238264    -7.99   0.000    -32.21268   -19.50286
      wkr5_1933 |          0  (omitted)
      wkr6_1928 |  -90.08941   5.105626   -17.65   0.000    -100.1089   -80.06991
      wkr6_1930 |   -58.2537   5.859643    -9.94   0.000    -69.75292   -46.75448
  wkr6_1932_jul |   -23.5403   3.296666    -7.14   0.000    -30.00982   -17.07078
  wkr6_1932_nov |  -27.55363   3.303777    -8.34   0.000     -34.0371   -21.07015
      wkr6_1933 |          0  (omitted)
      wkr7_1928 |  -96.29891   5.215395   -18.46   0.000    -106.5338   -86.06399
      wkr7_1930 |  -56.95778   5.971114    -9.54   0.000    -68.67575   -45.23981
  wkr7_1932_jul |  -17.65713    3.33025    -5.30   0.000    -24.19255    -11.1217
  wkr7_1932_nov |  -22.35016   3.396455    -6.58   0.000    -29.01551   -15.68481
      wkr7_1933 |          0  (omitted)
      wkr8_1928 |  -94.37308   5.075123   -18.60   0.000    -104.3327   -84.41344
      wkr8_1930 |  -62.11184   5.698594   -10.90   0.000    -73.29501   -50.92867
  wkr8_1932_jul |  -18.75166   3.159675    -5.93   0.000    -24.95234   -12.55097
  wkr8_1932_nov |  -24.58853   3.227877    -7.62   0.000    -30.92305     -18.254
      wkr8_1933 |          0  (omitted)
      wkr9_1928 |  -93.25638   4.775254   -19.53   0.000    -102.6275   -83.88521
      wkr9_1930 |  -67.25541   5.423619   -12.40   0.000    -77.89895   -56.61186
  wkr9_1932_jul |   -19.9878   3.081307    -6.49   0.000    -26.03469   -13.94091
  wkr9_1932_nov |  -25.07098    3.09205    -8.11   0.000    -31.13895   -19.00301
      wkr9_1933 |          0  (omitted)
     wkr10_1928 |  -93.04642   5.075019   -18.33   0.000    -103.0059   -83.08699
     wkr10_1930 |  -61.63226   5.800263   -10.63   0.000    -73.01495   -50.24957
 wkr10_1932_jul |  -18.34425   3.256332    -5.63   0.000    -24.73462   -11.95388
 wkr10_1932_nov |  -22.90512   3.291465    -6.96   0.000    -29.36444   -16.44581
     wkr10_1933 |          0  (omitted)
     wkr11_1928 |   -84.9931    5.06431   -16.78   0.000    -94.93152   -75.05468
     wkr11_1930 |   -54.4681   6.006772    -9.07   0.000    -66.25605   -42.68015
 wkr11_1932_jul |  -17.53508   3.262593    -5.37   0.000    -23.93773   -11.13242
 wkr11_1932_nov |  -24.15274   3.335649    -7.24   0.000    -30.69876   -17.60672
     wkr11_1933 |          0  (omitted)
     wkr12_1928 |  -85.89772   5.004929   -17.16   0.000    -95.71961   -76.07583
     wkr12_1930 |  -55.87022   5.752865    -9.71   0.000    -67.15989   -44.58055
 wkr12_1932_jul |   -16.1779   3.120126    -5.19   0.000    -22.30097   -10.05483
 wkr12_1932_nov |  -22.10229   3.229361    -6.84   0.000    -28.43973   -15.76485
     wkr12_1933 |          0  (omitted)
     wkr13_1928 |  -91.43988    4.94474   -18.49   0.000    -101.1436   -81.73611
     wkr13_1930 |   -56.6115   5.687017    -9.95   0.000    -67.77195   -45.45105
 wkr13_1932_jul |   -16.6369   3.094519    -5.38   0.000    -22.70972   -10.56408
 wkr13_1932_nov |  -20.06281   3.158341    -6.35   0.000    -26.26088   -13.86475
     wkr13_1933 |          0  (omitted)
     wkr14_1928 |  -80.44518   4.938992   -16.29   0.000    -90.13767   -70.75269
     wkr14_1930 |  -49.73821   5.620672    -8.85   0.000    -60.76846   -38.70796
 wkr14_1932_jul |  -13.68422   3.016775    -4.54   0.000    -19.60447   -7.763974
 wkr14_1932_nov |  -19.95575   3.037741    -6.57   0.000    -25.91714   -13.99435
     wkr14_1933 |          0  (omitted)
     wkr15_1928 |  -92.85233   5.053896   -18.37   0.000    -102.7703   -82.93435
     wkr15_1930 |  -62.55229    5.60845   -11.15   0.000    -73.55856   -51.54602
 wkr15_1932_jul |  -17.37892    3.13274    -5.55   0.000    -23.52674    -11.2311
 wkr15_1932_nov |  -24.21258   3.183764    -7.61   0.000    -30.46054   -17.96463
     wkr15_1933 |          0  (omitted)
     wkr16_1928 |  -91.49609   5.035471   -18.17   0.000    -101.3779   -81.61426
     wkr16_1930 |  -56.46417    5.81642    -9.71   0.000    -67.87856   -45.04977
 wkr16_1932_jul |  -16.22337   3.395353    -4.78   0.000    -22.88656   -9.560186
 wkr16_1932_nov |  -21.72821   3.231343    -6.72   0.000    -28.06954   -15.38688
     wkr16_1933 |          0  (omitted)
     wkr17_1928 |  -87.54178   4.980023   -17.58   0.000    -97.31479   -77.76877
     wkr17_1930 |  -56.94047   5.741946    -9.92   0.000    -68.20871   -45.67223
 wkr17_1932_jul |  -18.47905   3.157103    -5.85   0.000    -24.67469   -12.28342
 wkr17_1932_nov |  -23.74121   3.200238    -7.42   0.000     -30.0215   -17.46093
     wkr17_1933 |          0  (omitted)
     wkr18_1928 |  -84.33534   5.053961   -16.69   0.000    -94.25345   -74.41722
     wkr18_1930 |  -52.50366   5.788653    -9.07   0.000    -63.86357   -41.14376
 wkr18_1932_jul |  -15.56946   3.170406    -4.91   0.000     -21.7912   -9.347714
 wkr18_1932_nov |  -19.69393   3.246744    -6.07   0.000    -26.06548   -13.32238
     wkr18_1933 |          0  (omitted)
     wkr19_1928 |  -89.83506   4.822268   -18.63   0.000    -99.29849   -80.37163
     wkr19_1930 |  -58.95292   5.602937   -10.52   0.000    -69.94836   -47.95747
 wkr19_1932_jul |   -16.8661   3.121145    -5.40   0.000    -22.99117   -10.74103
 wkr19_1932_nov |  -19.32833   3.118945    -6.20   0.000    -25.44908   -13.20757
     wkr19_1933 |          0  (omitted)
     wkr20_1928 |  -89.54791   4.758294   -18.82   0.000    -98.88579   -80.21002
     wkr20_1930 |  -54.88664   5.475629   -10.02   0.000    -65.63225   -44.14102
 wkr20_1932_jul |  -18.66926    3.10354    -6.02   0.000    -24.75978   -12.57874
 wkr20_1932_nov |  -23.45352   3.189066    -7.35   0.000    -29.71188   -17.19516
     wkr20_1933 |          0  (omitted)
     wkr21_1928 |  -87.68282   4.786636   -18.32   0.000    -97.07632   -78.28932
     wkr21_1930 |  -55.15404   5.507394   -10.01   0.000    -65.96199   -44.34609
 wkr21_1932_jul |  -16.34955   3.108342    -5.26   0.000    -22.44949    -10.2496
 wkr21_1932_nov |  -22.58194   3.126456    -7.22   0.000    -28.71743   -16.44645
     wkr21_1933 |          0  (omitted)
     wkr22_1928 |    -84.997   5.115464   -16.62   0.000    -95.03581   -74.95819
     wkr22_1930 |  -50.59865     5.8345    -8.67   0.000    -62.04853   -39.14878
 wkr22_1932_jul |  -14.52848    3.17628    -4.57   0.000    -20.76175   -8.295206
 wkr22_1932_nov |  -19.36165   3.248504    -5.96   0.000    -25.73666   -12.98665
     wkr22_1933 |          0  (omitted)
     wkr23_1928 |  -92.79616   4.935546   -18.80   0.000    -102.4819   -83.11043
     wkr23_1930 |  -56.19436    5.82303    -9.65   0.000    -67.62173   -44.76699
 wkr23_1932_jul |  -16.61314   3.137188    -5.30   0.000     -22.7697   -10.45659
 wkr23_1932_nov |   -21.2862   3.236017    -6.58   0.000     -27.6367    -14.9357
     wkr23_1933 |          0  (omitted)
     wkr24_1928 |  -85.05378   5.372229   -15.83   0.000    -95.59647   -74.51108
     wkr24_1930 |  -60.10531   6.175904    -9.73   0.000    -72.22517   -47.98545
 wkr24_1932_jul |  -18.86011   3.441646    -5.48   0.000    -25.61415   -12.10607
 wkr24_1932_nov |  -23.32667   3.437225    -6.79   0.000    -30.07203   -16.58131
     wkr24_1933 |          0  (omitted)
     wkr25_1928 |  -84.04637    5.09478   -16.50   0.000    -94.04459   -74.04815
     wkr25_1930 |  -59.71493   5.859724   -10.19   0.000    -71.21431   -48.21556
 wkr25_1932_jul |  -20.94278   3.296567    -6.35   0.000    -27.41211   -14.47346
 wkr25_1932_nov |  -26.44051   3.253613    -8.13   0.000    -32.82555   -20.05548
     wkr25_1933 |          0  (omitted)
     wkr26_1928 |  -79.30692   5.120028   -15.49   0.000    -89.35468   -69.25915
     wkr26_1930 |  -55.70334   5.941946    -9.37   0.000    -67.36408   -44.04261
 wkr26_1932_jul |  -14.00045   3.244795    -4.31   0.000    -20.36818   -7.632724
 wkr26_1932_nov |  -19.00719    3.25802    -5.83   0.000    -25.40088   -12.61351
     wkr26_1933 |          0  (omitted)
     wkr27_1928 |  -89.60091   4.723918   -18.97   0.000    -98.87133   -80.33049
     wkr27_1930 |  -56.03954   5.417264   -10.34   0.000    -66.67062   -45.40847
 wkr27_1932_jul |  -10.62523   3.082202    -3.45   0.001    -16.67387   -4.576579
 wkr27_1932_nov |  -14.06696   3.135791    -4.49   0.000    -20.22077   -7.913145
     wkr27_1933 |          0  (omitted)
     wkr28_1928 |  -87.91492   5.128891   -17.14   0.000    -97.98008   -77.84976
     wkr28_1930 |  -59.84887   5.805479   -10.31   0.000    -71.24179   -48.45595
 wkr28_1932_jul |  -18.19753   3.287408    -5.54   0.000    -24.64888   -11.74617
 wkr28_1932_nov |  -23.69168   3.365938    -7.04   0.000    -30.29715   -17.08622
     wkr28_1933 |          0  (omitted)
     wkr29_1928 |   -87.4072   5.185264   -16.86   0.000    -97.58299   -77.23141
     wkr29_1930 |  -59.11242   5.908245   -10.01   0.000    -70.70702   -47.51782
 wkr29_1932_jul |  -17.22061   3.273902    -5.26   0.000    -23.64546   -10.79576
 wkr29_1932_nov |  -22.17373   3.350714    -6.62   0.000    -28.74931   -15.59814
     wkr29_1933 |          0  (omitted)
     wkr30_1928 |  -89.34333   5.001232   -17.86   0.000    -99.15796   -79.52869
     wkr30_1930 |  -56.15803   5.825774    -9.64   0.000    -67.59078   -44.72527
 wkr30_1932_jul |  -17.04985   3.211713    -5.31   0.000    -23.35266   -10.74705
 wkr30_1932_nov |  -20.19193   3.246552    -6.22   0.000     -26.5631   -13.82076
     wkr30_1933 |          0  (omitted)
     wkr31_1928 |  -81.90345   4.750904   -17.24   0.000    -91.22683   -72.58007
     wkr31_1930 |  -58.85351   5.532735   -10.64   0.000    -69.71119   -47.99583
 wkr31_1932_jul |  -19.96184   3.039617    -6.57   0.000    -25.92692   -13.99677
 wkr31_1932_nov |   -25.1939   3.115016    -8.09   0.000    -31.30695   -19.08086
     wkr31_1933 |          0  (omitted)
     wkr32_1928 |    -90.858   4.602416   -19.74   0.000    -99.88998   -81.82602
     wkr32_1930 |  -58.62553   5.310235   -11.04   0.000    -69.04657    -48.2045
 wkr32_1932_jul |  -16.14205   2.894968    -5.58   0.000    -21.82326   -10.46084
 wkr32_1932_nov |  -21.10424    2.99649    -7.04   0.000    -26.98469    -15.2238
     wkr32_1933 |          0  (omitted)
     wkr33_1928 |  -92.45997   5.051308   -18.30   0.000    -102.3729   -82.54707
     wkr33_1930 |  -59.49335   5.580964   -10.66   0.000    -70.44567   -48.54102
 wkr33_1932_jul |  -14.28189    2.99017    -4.78   0.000    -20.14993   -8.413848
 wkr33_1932_nov |  -18.15563   3.046962    -5.96   0.000    -24.13512   -12.17614
     wkr33_1933 |          0  (omitted)
     wkr34_1928 |  -235.8803   133.1306    -1.77   0.077    -497.1414    25.38091
     wkr34_1930 |  -269.1081   119.7957    -2.25   0.025    -504.2003   -34.01593
 wkr34_1932_jul |  -45.51881   59.93778    -0.76   0.448    -163.1433    72.10569
 wkr34_1932_nov |  -26.02226    63.9466    -0.41   0.684    -151.5138    99.46932
     wkr34_1933 |          0  (omitted)
     wkr35_1928 |  -90.37967   4.957451   -18.23   0.000    -100.1084   -80.65095
     wkr35_1930 |  -61.25182   5.770612   -10.61   0.000    -72.57632   -49.92732
 wkr35_1932_jul |  -18.52233   3.114988    -5.95   0.000    -24.63532   -12.40935
 wkr35_1932_nov |  -26.42361   3.204075    -8.25   0.000    -32.71143    -20.1358
     wkr35_1933 |          0  (omitted)
                |
        yearDes |
          n309  |          0  (omitted)
          n327  |          0  (omitted)
          n32n  |          0  (omitted)
          n333  |          0  (omitted)
                |
          _cons |   52.82766   7.049027     7.49   0.000     38.99435    66.66098
----------------+----------------------------------------------------------------
        sigma_u |  158.40484
        sigma_e |  3.2636281
            rho |  .99957569   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

.  
. *Table for Column 3 
. outreg2 Nazi_share ss_artf est save "Table3_replica.doc" using "Table3_replica.doc", append ctitle("", Nazi Vote Share,"",All parl
> iamentary elections 1928-1933,"", Panel: OLS) keep(ss_artf) addtext (Baseline controls interacted with time fixed effects, Yes, Ba
> seline controls, No, District fixed effects, Yes, Time fixed effects, Yes) 
Table3_replica.doc
dir : seeout

.  
. *Regression for Column 4 
. xtreg Nazi_share ss_nl_artf /* 
> */ pop_1 pop_2 pop_3 pop_4 pop_5 pop_2_1 pop_2_2 pop_2_3 pop_2_4 pop_2_5 pop_3_1 pop_3_2 pop_3_3 pop_3_4 pop_3_5 pop_4_1 pop_4_2 p
> op_4_3 pop_4_4 pop_4_5 pop_5_1 pop_5_2 pop_5_3 pop_5_4 pop_5_5/* Socio-economic and geographical factors 
> */ jewishpop1 jewishpop2 jewishpop3 jewishpop4 jewishpop5 cathpop1 cathpop2 cathpop3 cathpop4 cathpop5 bluecollar1 bluecollar2 blu
> ecollar3 bluecollar4 bluecollar5 whitecollar1 whitecollar2 whitecollar3 whitecollar4 whitecollar5 city1 city2 city3 city4 city5 wa
> rparticipant1 warparticipant2 warparticipant3 warparticipant4 warparticipant5 welfare1 welfare2 welfare3 welfare4 welfare5 socialr
> ent1 socialrent2 socialrent3 socialrent4 socialrent5 proptax1 proptax2 proptax3 proptax4 proptax5 altitude1 altitude2 altitude3 al
> titude4 altitude5 unemployed1 unemployed2 unemployed3 unemployed4 unemployed5 partemploy1 partemploy2 partemploy3 partemploy4 part
> employ5 bigd1 bigd2 bigd3 bigd4 bigd5 /* 
> */ turnout1 turnout2 turnout3 turnout4 turnout5 dnvpshare1 dnvpshare2 dnvpshare3 dnvpshare4 dnvpshare5 nsfpshare1 nsfpshare2 nsfps
> hare3 nsfpshare4 nsfpshare5 spdshare1 spdshare2 spdshare3 spdshare4 spdshare5 zentrumshare1 zentrumshare2 zentrumshare3 zentrumsha
> re4 zentrumshare5 /* 
> */ wkr*_* /*  
> */ i.yearDes, fe cluster(id) 
note: pop_4_5 omitted because of collinearity
note: pop_5_5 omitted because of collinearity
note: jewishpop5 omitted because of collinearity
note: cathpop5 omitted because of collinearity
note: bluecollar5 omitted because of collinearity
note: whitecollar5 omitted because of collinearity
note: city5 omitted because of collinearity
note: warparticipant5 omitted because of collinearity
note: welfare5 omitted because of collinearity
note: socialrent5 omitted because of collinearity
note: proptax5 omitted because of collinearity
note: altitude5 omitted because of collinearity
note: unemployed5 omitted because of collinearity
note: partemploy5 omitted because of collinearity
note: bigd5 omitted because of collinearity
note: turnout5 omitted because of collinearity
note: dnvpshare5 omitted because of collinearity
note: nsfpshare5 omitted because of collinearity
note: spdshare5 omitted because of collinearity
note: zentrumshare5 omitted because of collinearity
note: wkr1_1933 omitted because of collinearity
note: wkr2_1928 omitted because of collinearity
note: wkr2_1930 omitted because of collinearity
note: wkr2_1932_jul omitted because of collinearity
note: wkr2_1932_nov omitted because of collinearity
note: wkr2_1933 omitted because of collinearity
note: wkr3_1928 omitted because of collinearity
note: wkr3_1930 omitted because of collinearity
note: wkr3_1932_jul omitted because of collinearity
note: wkr3_1932_nov omitted because of collinearity
note: wkr3_1933 omitted because of collinearity
note: wkr4_1933 omitted because of collinearity
note: wkr5_1933 omitted because of collinearity
note: wkr6_1933 omitted because of collinearity
note: wkr7_1933 omitted because of collinearity
note: wkr8_1933 omitted because of collinearity
note: wkr9_1933 omitted because of collinearity
note: wkr10_1933 omitted because of collinearity
note: wkr11_1933 omitted because of collinearity
note: wkr12_1933 omitted because of collinearity
note: wkr13_1933 omitted because of collinearity
note: wkr14_1933 omitted because of collinearity
note: wkr15_1933 omitted because of collinearity
note: wkr16_1933 omitted because of collinearity
note: wkr17_1933 omitted because of collinearity
note: wkr18_1933 omitted because of collinearity
note: wkr19_1933 omitted because of collinearity
note: wkr20_1933 omitted because of collinearity
note: wkr21_1933 omitted because of collinearity
note: wkr22_1933 omitted because of collinearity
note: wkr23_1933 omitted because of collinearity
note: wkr24_1933 omitted because of collinearity
note: wkr25_1933 omitted because of collinearity
note: wkr26_1933 omitted because of collinearity
note: wkr27_1933 omitted because of collinearity
note: wkr28_1933 omitted because of collinearity
note: wkr29_1933 omitted because of collinearity
note: wkr30_1933 omitted because of collinearity
note: wkr31_1933 omitted because of collinearity
note: wkr32_1933 omitted because of collinearity
note: wkr33_1933 omitted because of collinearity
note: wkr34_1933 omitted because of collinearity
note: wkr35_1933 omitted because of collinearity
note: 5.yearDes omitted because of collinearity
note: 6.yearDes omitted because of collinearity
note: 7.yearDes omitted because of collinearity
note: 8.yearDes omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,713
Group variable: id                              Number of groups  =        959

R-sq:                                           Obs per group:
     within  = 0.9719                                         min =          2
     between = 0.0003                                         avg =        4.9
     overall = 0.0090                                         max =          5

                                                F(220,958)        =          .
corr(u_i, Xb)  = -0.9930                        Prob > F          =          .

                                      (Std. Err. adjusted for 959 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
     Nazi_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
     ss_nl_artf |   .1227587   .0271217     4.53   0.000     .0695339    .1759834
          pop_1 |  -.0177099   .0396604    -0.45   0.655    -.0955413    .0601214
          pop_2 |  -.0441136   .0394962    -1.12   0.264    -.1216226    .0333954
          pop_3 |  -.0121325   .0337003    -0.36   0.719    -.0782675    .0540025
          pop_4 |  -.0101281   .0347007    -0.29   0.770    -.0782261      .05797
          pop_5 |  -.0192999   .0319419    -0.60   0.546    -.0819841    .0433843
        pop_2_1 |   .0002186   .0002373     0.92   0.357    -.0002471    .0006844
        pop_2_2 |   .0003473   .0002301     1.51   0.132    -.0001043    .0007989
        pop_2_3 |   .0000546   .0001567     0.35   0.728    -.0002529    .0003621
        pop_2_4 |   .0000266   .0001601     0.17   0.868    -.0002877    .0003408
        pop_2_5 |   .0000745   .0001129     0.66   0.509    -.0001471    .0002962
        pop_3_1 |  -6.31e-07   5.98e-07    -1.06   0.292    -1.81e-06    5.43e-07
        pop_3_2 |  -9.49e-07   5.67e-07    -1.67   0.095    -2.06e-06    1.64e-07
        pop_3_3 |  -8.91e-08   3.27e-07    -0.27   0.785    -7.31e-07    5.53e-07
        pop_3_4 |  -7.13e-09   3.35e-07    -0.02   0.983    -6.65e-07    6.51e-07
        pop_3_5 |  -9.39e-08   1.12e-07    -0.84   0.400    -3.13e-07    1.25e-07
        pop_4_1 |   5.73e-10   5.54e-10     1.03   0.301    -5.14e-10    1.66e-09
        pop_4_2 |   8.65e-10   5.21e-10     1.66   0.097    -1.57e-10    1.89e-09
        pop_4_3 |   2.32e-11   2.80e-10     0.08   0.934    -5.27e-10    5.73e-10
        pop_4_4 |  -5.96e-11   2.99e-10    -0.20   0.842    -6.46e-10    5.27e-10
        pop_4_5 |          0  (omitted)
        pop_5_1 |  -1.11e-13   1.06e-13    -1.05   0.292    -3.19e-13    9.61e-14
        pop_5_2 |  -1.66e-13   9.90e-14    -1.68   0.093    -3.60e-13    2.80e-14
        pop_5_3 |  -5.81e-15   5.29e-14    -0.11   0.913    -1.10e-13    9.80e-14
        pop_5_4 |   1.01e-14   5.63e-14     0.18   0.857    -1.00e-13    1.21e-13
        pop_5_5 |          0  (omitted)
     jewishpop1 |  -208.2642   41.11786    -5.07   0.000    -288.9557   -127.5728
     jewishpop2 |  -148.6975   39.51244    -3.76   0.000    -226.2384   -71.15661
     jewishpop3 |  -60.98401   28.70677    -2.12   0.034    -117.3194   -4.648591
     jewishpop4 |   6.001323   27.45014     0.22   0.827    -47.86802    59.87067
     jewishpop5 |          0  (omitted)
       cathpop1 |    21.5402   2.026456    10.63   0.000     17.56339      25.517
       cathpop2 |   17.16095   2.141684     8.01   0.000     12.95802    21.36388
       cathpop3 |   -7.06921   1.200122    -5.89   0.000    -9.424381    -4.71404
       cathpop4 |  -2.404514    1.12026    -2.15   0.032    -4.602961   -.2060679
       cathpop5 |          0  (omitted)
    bluecollar1 |   11.26351   3.728137     3.02   0.003     3.947254    18.57977
    bluecollar2 |   5.425624   3.488515     1.56   0.120     -1.42039    12.27164
    bluecollar3 |   1.006774   1.613818     0.62   0.533    -2.160253    4.173801
    bluecollar4 |   2.589047   1.662263     1.56   0.120    -.6730495    5.851144
    bluecollar5 |          0  (omitted)
   whitecollar1 |   20.24881   6.808304     2.97   0.003     6.887901    33.60972
   whitecollar2 |    27.5287   5.882478     4.68   0.000     15.98467    39.07273
   whitecollar3 |   12.84369   3.504638     3.66   0.000     5.966035    19.72134
   whitecollar4 |   8.674486   3.018872     2.87   0.004      2.75012    14.59885
   whitecollar5 |          0  (omitted)
          city1 |   .7538198   .9357396     0.81   0.421    -1.082516    2.590156
          city2 |   .7395695   .9061727     0.82   0.415    -1.038743    2.517882
          city3 |  -.2326508   .5005136    -0.46   0.642     -1.21488    .7495787
          city4 |  -.1946659   .4534577    -0.43   0.668    -1.084551    .6952192
          city5 |          0  (omitted)
warparticipant1 |  -.0785543   .0892102    -0.88   0.379    -.2536243    .0965156
warparticipant2 |  -.0121574   .0843284    -0.14   0.885    -.1776471    .1533322
warparticipant3 |  -.0232637   .0518016    -0.45   0.653    -.1249214     .078394
warparticipant4 |   .0456561   .0475419     0.96   0.337    -.0476422    .1389544
warparticipant5 |          0  (omitted)
       welfare1 |   .0335979   .0233979     1.44   0.151    -.0123192    .0795149
       welfare2 |   .0346907   .0242748     1.43   0.153    -.0129473    .0823286
       welfare3 |   .0187965   .0142202     1.32   0.187    -.0091099    .0467029
       welfare4 |   .0057849   .0133581     0.43   0.665    -.0204296    .0319995
       welfare5 |          0  (omitted)
    socialrent1 |   .0801463   .0608235     1.32   0.188    -.0392165    .1995091
    socialrent2 |   .0335306   .0653329     0.51   0.608    -.0946815    .1617426
    socialrent3 |    .021277   .0363417     0.59   0.558    -.0500415    .0925955
    socialrent4 |   .0426978   .0350042     1.22   0.223    -.0259959    .1113915
    socialrent5 |          0  (omitted)
       proptax1 |    .528144   .3463991     1.52   0.128    -.1516446    1.207933
       proptax2 |   .6566882   .3708842     1.77   0.077     -.071151    1.384527
       proptax3 |   .3508902   .1877107     1.87   0.062    -.0174814    .7192617
       proptax4 |  -.2364124   .1987819    -1.19   0.235    -.6265106    .1536859
       proptax5 |          0  (omitted)
      altitude1 |  -.0131511   .0018129    -7.25   0.000    -.0167088   -.0095934
      altitude2 |  -.0100487   .0018171    -5.53   0.000    -.0136146   -.0064827
      altitude3 |   -.001804   .0010894    -1.66   0.098    -.0039419    .0003339
      altitude4 |  -.0013036   .0011456    -1.14   0.255    -.0035518    .0009446
      altitude5 |          0  (omitted)
    unemployed1 |   49.54646   10.08476     4.91   0.000     29.75569    69.33722
    unemployed2 |    43.3751   9.664181     4.49   0.000     24.40969    62.34051
    unemployed3 |   22.31566    6.13751     3.64   0.000     10.27115    34.36018
    unemployed4 |   18.87687   4.481245     4.21   0.000     10.08268    27.67106
    unemployed5 |          0  (omitted)
    partemploy1 |  -10.92263   9.603292    -1.14   0.256    -29.76855    7.923283
    partemploy2 |  -10.39407    11.0294    -0.94   0.346    -32.03864     11.2505
    partemploy3 |   .2975518   6.689001     0.04   0.965    -12.82923    13.42434
    partemploy4 |  -.9174128   5.730141    -0.16   0.873    -12.16249    10.32766
    partemploy5 |          0  (omitted)
          bigd1 |    .373591   .2455002     1.52   0.128    -.1081893    .8553713
          bigd2 |   .0908292   .2308854     0.39   0.694    -.3622704    .5439287
          bigd3 |   .0806284   .1252836     0.64   0.520    -.1652336    .3264904
          bigd4 |   .1591081   .1222172     1.30   0.193    -.0807364    .3989525
          bigd5 |          0  (omitted)
       turnout1 |   26.90867   4.460278     6.03   0.000     18.15563    35.66172
       turnout2 |   10.63676   4.901831     2.17   0.030     1.017197    20.25633
       turnout3 |   4.683502   2.839409     1.65   0.099    -.8886765    10.25568
       turnout4 |   5.670875   2.820022     2.01   0.045     .1367408    11.20501
       turnout5 |          0  (omitted)
     dnvpshare1 |  -20.27065   2.613399    -7.76   0.000    -25.39929     -15.142
     dnvpshare2 |  -2.488891   2.854778    -0.87   0.384    -8.091231    3.113448
     dnvpshare3 |   6.840132   1.659386     4.12   0.000     3.583682    10.09658
     dnvpshare4 |   5.449014   1.424765     3.82   0.000     2.652993    8.245036
     dnvpshare5 |          0  (omitted)
     nsfpshare1 |   9.901587   8.680693     1.14   0.254    -7.133782    26.93695
     nsfpshare2 |   21.59852   8.906868     2.42   0.015     4.119295    39.07774
     nsfpshare3 |   9.477277   3.462348     2.74   0.006     2.682615    16.27194
     nsfpshare4 |   9.843606   3.744612     2.63   0.009     2.495018    17.19219
     nsfpshare5 |          0  (omitted)
      spdshare1 |   18.19551   3.318337     5.48   0.000     11.68346    24.70755
      spdshare2 |   20.68675   3.548549     5.83   0.000     13.72293    27.65058
      spdshare3 |   2.020669   1.955802     1.03   0.302    -1.817482    5.858821
      spdshare4 |   8.663743   1.877512     4.61   0.000     4.979232    12.34825
      spdshare5 |          0  (omitted)
  zentrumshare1 |   6.163854   2.410612     2.56   0.011     1.433165    10.89454
  zentrumshare2 |   .5509166   2.389463     0.23   0.818    -4.138269    5.240102
  zentrumshare3 |   3.173847   1.422717     2.23   0.026     .3818458    5.965848
  zentrumshare4 |   3.898381   1.368933     2.85   0.004     1.211928    6.584833
  zentrumshare5 |          0  (omitted)
      wkr1_1928 |  -90.52792   4.934799   -18.34   0.000    -100.2122   -80.84366
      wkr1_1930 |  -56.64137   5.833954    -9.71   0.000    -68.09017   -45.19257
  wkr1_1932_jul |  -17.08373   3.454651    -4.95   0.000    -23.86329   -10.30417
  wkr1_1932_nov |  -24.28089   3.449948    -7.04   0.000    -31.05122   -17.51056
      wkr1_1933 |          0  (omitted)
      wkr2_1928 |          0  (omitted)
      wkr2_1930 |          0  (omitted)
  wkr2_1932_jul |          0  (omitted)
  wkr2_1932_nov |          0  (omitted)
      wkr2_1933 |          0  (omitted)
      wkr3_1928 |          0  (omitted)
      wkr3_1930 |          0  (omitted)
  wkr3_1932_jul |          0  (omitted)
  wkr3_1932_nov |          0  (omitted)
      wkr3_1933 |          0  (omitted)
      wkr4_1928 |  -86.63206   5.150123   -16.82   0.000    -96.73888   -76.52523
      wkr4_1930 |  -51.90334   5.968488    -8.70   0.000    -63.61617   -40.19052
  wkr4_1932_jul |  -15.57302   3.541831    -4.40   0.000    -22.52366   -8.622378
  wkr4_1932_nov |  -20.24959   3.584189    -5.65   0.000    -27.28336   -13.21583
      wkr4_1933 |          0  (omitted)
      wkr5_1928 |  -91.79217   5.077549   -18.08   0.000    -101.7566   -81.82777
      wkr5_1930 |  -56.03067   5.947858    -9.42   0.000      -67.703   -44.35834
  wkr5_1932_jul |   -15.5948   3.483058    -4.48   0.000     -22.4301   -8.759491
  wkr5_1932_nov |  -21.25463    3.52479    -6.03   0.000    -28.17183   -14.33743
      wkr5_1933 |          0  (omitted)
      wkr6_1928 |  -87.68887   5.158622   -17.00   0.000    -97.81237   -77.56537
      wkr6_1930 |  -53.27009   6.035699    -8.83   0.000    -65.11481   -41.42537
  wkr6_1932_jul |  -18.72831    3.55895    -5.26   0.000    -25.71255   -11.74408
  wkr6_1932_nov |  -22.62108   3.592909    -6.30   0.000    -29.67196    -15.5702
      wkr6_1933 |          0  (omitted)
      wkr7_1928 |  -94.08064   5.276094   -17.83   0.000    -104.4347    -83.7266
      wkr7_1930 |  -52.20193    6.17051    -8.46   0.000    -64.31121   -40.09265
  wkr7_1932_jul |  -13.11359   3.616554    -3.63   0.000    -20.21088   -6.016311
  wkr7_1932_nov |  -17.79464   3.727225    -4.77   0.000     -25.1091   -10.48017
      wkr7_1933 |          0  (omitted)
      wkr8_1928 |  -92.18816   5.129064   -17.97   0.000    -102.2537   -82.12267
      wkr8_1930 |  -57.46512   5.878615    -9.78   0.000    -69.00157   -45.92867
  wkr8_1932_jul |  -14.21075   3.426042    -4.15   0.000    -20.93416   -7.487334
  wkr8_1932_nov |  -20.09934   3.524618    -5.70   0.000     -27.0162   -13.18248
      wkr8_1933 |          0  (omitted)
      wkr9_1928 |  -91.04832   4.844391   -18.79   0.000    -100.5552   -81.54148
      wkr9_1930 |  -62.40594   5.658404   -11.03   0.000    -73.51024   -51.30164
  wkr9_1932_jul |  -15.47294   3.405824    -4.54   0.000    -22.15667   -8.789202
  wkr9_1932_nov |  -20.56385    3.43987    -5.98   0.000     -27.3144    -13.8133
      wkr9_1933 |          0  (omitted)
     wkr10_1928 |  -90.86032   5.124836   -17.73   0.000    -100.9175   -80.80312
     wkr10_1930 |  -56.96628   5.972983    -9.54   0.000    -68.68793   -45.24464
 wkr10_1932_jul |  -13.85751   3.514692    -3.94   0.000    -20.75489   -6.960121
 wkr10_1932_nov |  -18.33629   3.577325    -5.13   0.000    -25.35658   -11.31599
     wkr10_1933 |          0  (omitted)
     wkr11_1928 |  -82.75789   5.118882   -16.17   0.000     -92.8034   -72.71237
     wkr11_1930 |  -49.70621   6.185236    -8.04   0.000    -61.84438   -37.56803
 wkr11_1932_jul |  -13.04714   3.535061    -3.69   0.000    -19.98449   -6.109781
 wkr11_1932_nov |  -19.55242   3.626723    -5.39   0.000    -26.66966   -12.43518
     wkr11_1933 |          0  (omitted)
     wkr12_1928 |  -83.66219   5.058981   -16.54   0.000    -93.59015   -73.73422
     wkr12_1930 |  -51.15304   5.931971    -8.62   0.000    -62.79419   -39.51188
 wkr12_1932_jul |  -11.59691   3.394245    -3.42   0.001    -18.25793   -4.935898
 wkr12_1932_nov |  -17.39843   3.535676    -4.92   0.000      -24.337   -10.45987
     wkr12_1933 |          0  (omitted)
     wkr13_1928 |  -89.15434   4.998873   -17.83   0.000    -98.96435   -79.34434
     wkr13_1930 |  -51.77335   5.866215    -8.83   0.000    -63.28546   -40.26123
 wkr13_1932_jul |  -11.99703   3.385937    -3.54   0.000    -18.64174   -5.352322
 wkr13_1932_nov |  -15.37564   3.463528    -4.44   0.000    -22.17261   -8.578658
     wkr13_1933 |          0  (omitted)
     wkr14_1928 |  -78.04247   4.986475   -15.65   0.000    -87.82814    -68.2568
     wkr14_1930 |  -44.77947   5.788795    -7.74   0.000    -56.13965   -33.41929
 wkr14_1932_jul |  -8.864243   3.294539    -2.69   0.007    -15.32959   -2.398897
 wkr14_1932_nov |  -15.06321   3.345313    -4.50   0.000    -21.62819   -8.498219
     wkr14_1933 |          0  (omitted)
     wkr15_1928 |  -90.52288   5.107937   -17.72   0.000    -100.5469   -80.49885
     wkr15_1930 |  -57.72493   5.798737    -9.95   0.000    -69.10462   -46.34523
 wkr15_1932_jul |   -12.6861   3.404332    -3.73   0.000     -19.3669   -6.005286
 wkr15_1932_nov |  -19.44287   3.474288    -5.60   0.000    -26.26096   -12.62478
     wkr15_1933 |          0  (omitted)
     wkr16_1928 |  -89.21159    5.08297   -17.55   0.000    -99.18664   -79.23655
     wkr16_1930 |  -51.67419    5.98529    -8.63   0.000    -63.41998    -39.9284
 wkr16_1932_jul |  -11.57802   3.639181    -3.18   0.002    -18.71971   -4.436334
 wkr16_1932_nov |  -17.02232   3.521831    -4.83   0.000    -23.93371   -10.11092
     wkr16_1933 |          0  (omitted)
     wkr17_1928 |  -85.27843   5.025602   -16.97   0.000    -95.14089   -75.41597
     wkr17_1930 |  -52.09593   5.906011    -8.82   0.000    -63.68614   -40.50571
 wkr17_1932_jul |  -13.82431   3.422888    -4.04   0.000    -20.54154   -7.107089
 wkr17_1932_nov |  -19.09676    3.49624    -5.46   0.000    -25.95793   -12.23559
     wkr17_1933 |          0  (omitted)
     wkr18_1928 |  -82.04513   5.121152   -16.02   0.000     -92.0951   -71.99516
     wkr18_1930 |  -47.46482   6.020901    -7.88   0.000    -59.28049   -35.64914
 wkr18_1932_jul |  -10.82805      3.504    -3.09   0.002    -17.70445   -3.951651
 wkr18_1932_nov |   -15.0194   3.595139    -4.18   0.000    -22.07466   -7.964144
     wkr18_1933 |          0  (omitted)
     wkr19_1928 |  -87.60885   4.879485   -17.95   0.000    -97.18456   -78.03313
     wkr19_1930 |  -54.16329   5.809595    -9.32   0.000    -65.56429   -42.76229
 wkr19_1932_jul |  -12.32883   3.420232    -3.60   0.000    -19.04084   -5.616819
 wkr19_1932_nov |  -14.77446   3.447095    -4.29   0.000    -21.53919   -8.009731
     wkr19_1933 |          0  (omitted)
     wkr20_1928 |  -87.36216   4.816663   -18.14   0.000    -96.81459   -77.90974
     wkr20_1930 |  -49.93278   5.693534    -8.77   0.000    -61.10601   -38.75954
 wkr20_1932_jul |  -14.02556    3.42349    -4.10   0.000    -20.74396   -7.307156
 wkr20_1932_nov |  -18.94421   3.503369    -5.41   0.000    -25.81937   -12.06904
     wkr20_1933 |          0  (omitted)
     wkr21_1928 |  -85.43936   4.848445   -17.62   0.000    -94.95416   -75.92456
     wkr21_1930 |  -50.41447   5.712721    -8.82   0.000    -61.62536   -39.20358
 wkr21_1932_jul |  -11.79262   3.406789    -3.46   0.001    -18.47826   -5.106994
 wkr21_1932_nov |  -18.00781   3.453117    -5.21   0.000    -24.78435   -11.23126
     wkr21_1933 |          0  (omitted)
     wkr22_1928 |  -82.57165   5.191987   -15.90   0.000    -92.76063   -72.38267
     wkr22_1930 |  -45.34061   6.110123    -7.42   0.000    -57.33138   -33.34984
 wkr22_1932_jul |  -9.700387   3.530049    -2.75   0.006    -16.62791   -2.772867
 wkr22_1932_nov |  -14.39082   3.642407    -3.95   0.000    -21.53884   -7.242805
     wkr22_1933 |          0  (omitted)
     wkr23_1928 |  -90.51601   4.997724   -18.11   0.000    -100.3238   -80.70826
     wkr23_1930 |   -51.1698   6.028207    -8.49   0.000    -62.99982   -39.33979
 wkr23_1932_jul |  -11.85766   3.463001    -3.42   0.001    -18.65361    -5.06172
 wkr23_1932_nov |  -16.60782   3.570271    -4.65   0.000    -23.61428   -9.601367
     wkr23_1933 |          0  (omitted)
     wkr24_1928 |  -82.80261   5.444709   -15.21   0.000    -93.48754   -72.11767
     wkr24_1930 |  -55.17461   6.412162    -8.60   0.000    -67.75812   -42.59111
 wkr24_1932_jul |  -14.24233   3.759346    -3.79   0.000    -21.61984   -6.864832
 wkr24_1932_nov |  -18.68273   3.762557    -4.97   0.000    -26.06654   -11.29893
     wkr24_1933 |          0  (omitted)
     wkr25_1928 |  -81.82805    5.15634   -15.87   0.000    -91.94708   -71.70902
     wkr25_1930 |  -54.88299   6.066781    -9.05   0.000     -66.7887   -42.97727
 wkr25_1932_jul |   -16.2968   3.587472    -4.54   0.000    -23.33701   -9.256587
 wkr25_1932_nov |  -21.73087   3.564104    -6.10   0.000    -28.72523   -14.73652
     wkr25_1933 |          0  (omitted)
     wkr26_1928 |  -77.10995   5.179972   -14.89   0.000    -87.27535   -66.94455
     wkr26_1930 |  -50.89301   6.148761    -8.28   0.000    -62.95961   -38.82642
 wkr26_1932_jul |  -9.469579   3.538649    -2.68   0.008    -16.41398   -2.525181
 wkr26_1932_nov |  -14.45969   3.565777    -4.06   0.000    -21.45732   -7.462053
     wkr26_1933 |          0  (omitted)
     wkr27_1928 |  -87.42855   4.782754   -18.28   0.000    -96.81443   -78.04267
     wkr27_1930 |  -51.33461   5.635307    -9.11   0.000    -62.39358   -40.27564
 wkr27_1932_jul |  -6.069965   3.411206    -1.78   0.075    -12.76426    .6243327
 wkr27_1932_nov |  -9.619147   3.471128    -2.77   0.006    -16.43104   -2.807255
     wkr27_1933 |          0  (omitted)
     wkr28_1928 |  -85.68953   5.183219   -16.53   0.000    -95.86131   -75.51776
     wkr28_1930 |  -55.08763   5.996701    -9.19   0.000    -66.85582   -43.31945
 wkr28_1932_jul |  -13.68995   3.557607    -3.85   0.000    -20.67155   -6.708346
 wkr28_1932_nov |  -19.10769       3.66    -5.22   0.000    -26.29023   -11.92514
     wkr28_1933 |          0  (omitted)
     wkr29_1928 |  -85.10745   5.246768   -16.22   0.000    -95.40393   -74.81096
     wkr29_1930 |  -54.28995   6.108541    -8.89   0.000    -66.27762   -42.30229
 wkr29_1932_jul |   -12.6578   3.555447    -3.56   0.000    -19.63517   -5.680441
 wkr29_1932_nov |  -17.52036   3.658239    -4.79   0.000    -24.69945   -10.34127
     wkr29_1933 |          0  (omitted)
     wkr30_1928 |  -87.17761   5.054961   -17.25   0.000    -97.09768   -77.25753
     wkr30_1930 |  -51.63425    5.98518    -8.63   0.000    -63.37983   -39.88868
 wkr30_1932_jul |  -12.63554    3.46978    -3.64   0.000    -19.44479   -5.826297
 wkr30_1932_nov |  -15.61917   3.530621    -4.42   0.000    -22.54781   -8.690522
     wkr30_1933 |          0  (omitted)
     wkr31_1928 |  -79.61535    4.82421   -16.50   0.000    -89.08259   -70.14811
     wkr31_1930 |  -53.95968   5.768963    -9.35   0.000    -65.28094   -42.63842
 wkr31_1932_jul |  -15.23106   3.398045    -4.48   0.000    -21.89953   -8.562593
 wkr31_1932_nov |  -20.55986    3.48666    -5.90   0.000    -27.40223   -13.71748
     wkr31_1933 |          0  (omitted)
     wkr32_1928 |  -88.56513   4.670212   -18.96   0.000    -97.73015    -79.4001
     wkr32_1930 |  -53.71164   5.533286    -9.71   0.000     -64.5704   -42.85288
 wkr32_1932_jul |  -11.42342   3.249151    -3.52   0.000    -17.79969   -5.047142
 wkr32_1932_nov |  -16.46726   3.349745    -4.92   0.000    -23.04095   -9.893579
     wkr32_1933 |          0  (omitted)
     wkr33_1928 |  -90.29378   5.112733   -17.66   0.000    -100.3272   -80.26033
     wkr33_1930 |  -54.81408   5.777296    -9.49   0.000     -66.1517   -43.47647
 wkr33_1932_jul |  -9.816803   3.298719    -2.98   0.003    -16.29035   -3.343253
 wkr33_1932_nov |  -13.71423   3.372191    -4.07   0.000    -20.33196   -7.096498
     wkr33_1933 |          0  (omitted)
     wkr34_1928 |  -233.0421   134.0894    -1.74   0.083    -496.1849     30.1008
     wkr34_1930 |   -260.402   121.3073    -2.15   0.032    -498.4608   -22.34326
 wkr34_1932_jul |  -31.54377   60.85224    -0.52   0.604    -150.9628     87.8753
 wkr34_1932_nov |  -13.79528   64.47871    -0.21   0.831    -140.3311    112.7405
     wkr34_1933 |          0  (omitted)
     wkr35_1928 |  -88.09058    5.01109   -17.58   0.000    -97.92456    -78.2566
     wkr35_1930 |  -56.49334   5.936363    -9.52   0.000    -68.14311   -44.84356
 wkr35_1932_jul |  -13.92602   3.388407    -4.11   0.000    -20.57558   -7.276462
 wkr35_1932_nov |  -21.75871   3.500702    -6.22   0.000    -28.62863   -14.88878
     wkr35_1933 |          0  (omitted)
                |
        yearDes |
          n309  |          0  (omitted)
          n327  |          0  (omitted)
          n32n  |          0  (omitted)
          n333  |          0  (omitted)
                |
          _cons |   50.72325   7.065946     7.18   0.000     36.85673    64.58977
----------------+----------------------------------------------------------------
        sigma_u |  161.06607
        sigma_e |  3.2610847
            rho |  .99959023   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

.  
. *Table Column 4 
.  
. outreg2 Nazi_share ss_nl_artf est save "Table3_replica.doc" using "Table3_replica.doc", append ctitle("", Nazi Vote Share,"",All p
> arliamentary elections 1928-1933,"", Panel: OLS) keep(ss_nl_artf) addtext (Baseline controls interacted with time fixed effects, Y
> es, Baseline controls, No, District fixed effects, Yes, Time fixed effects, Yes) 
Table3_replica.doc
dir : seeout

.  
. *Graph - edited in graph editor 
.  
. twoway qfitci Nazi_share ss_nl_artf 

. 
. //1
. xtreg Nazi_share ss_artf pop_1-wkr35_1933 i.yearDes, fe cluster(id) 
note: pop_4_5 omitted because of collinearity
note: pop_5_5 omitted because of collinearity
note: jewishpop5 omitted because of collinearity
note: cathpop5 omitted because of collinearity
note: bluecollar5 omitted because of collinearity
note: whitecollar5 omitted because of collinearity
note: city5 omitted because of collinearity
note: warparticipant5 omitted because of collinearity
note: welfare5 omitted because of collinearity
note: socialrent5 omitted because of collinearity
note: proptax5 omitted because of collinearity
note: altitude5 omitted because of collinearity
note: unemployed5 omitted because of collinearity
note: partemploy5 omitted because of collinearity
note: bigd5 omitted because of collinearity
note: turnout5 omitted because of collinearity
note: dnvpshare5 omitted because of collinearity
note: nsfpshare5 omitted because of collinearity
note: spdshare5 omitted because of collinearity
note: zentrumshare5 omitted because of collinearity
note: wkr1 omitted because of collinearity
note: wkr2 omitted because of collinearity
note: wkr3 omitted because of collinearity
note: wkr4 omitted because of collinearity
note: wkr5 omitted because of collinearity
note: wkr6 omitted because of collinearity
note: wkr7 omitted because of collinearity
note: wkr8 omitted because of collinearity
note: wkr9 omitted because of collinearity
note: wkr10 omitted because of collinearity
note: wkr11 omitted because of collinearity
note: wkr12 omitted because of collinearity
note: wkr13 omitted because of collinearity
note: wkr14 omitted because of collinearity
note: wkr15 omitted because of collinearity
note: wkr16 omitted because of collinearity
note: wkr17 omitted because of collinearity
note: wkr18 omitted because of collinearity
note: wkr19 omitted because of collinearity
note: wkr20 omitted because of collinearity
note: wkr21 omitted because of collinearity
note: wkr22 omitted because of collinearity
note: wkr23 omitted because of collinearity
note: wkr24 omitted because of collinearity
note: wkr25 omitted because of collinearity
note: wkr26 omitted because of collinearity
note: wkr27 omitted because of collinearity
note: wkr28 omitted because of collinearity
note: wkr29 omitted because of collinearity
note: wkr30 omitted because of collinearity
note: wkr31 omitted because of collinearity
note: wkr32 omitted because of collinearity
note: wkr33 omitted because of collinearity
note: wkr34 omitted because of collinearity
note: wkr35 omitted because of collinearity
note: wkr1_1933 omitted because of collinearity
note: wkr2_1928 omitted because of collinearity
note: wkr2_1930 omitted because of collinearity
note: wkr2_1932_jul omitted because of collinearity
note: wkr2_1932_nov omitted because of collinearity
note: wkr2_1933 omitted because of collinearity
note: wkr3_1928 omitted because of collinearity
note: wkr3_1930 omitted because of collinearity
note: wkr3_1932_jul omitted because of collinearity
note: wkr3_1932_nov omitted because of collinearity
note: wkr3_1933 omitted because of collinearity
note: wkr4_1933 omitted because of collinearity
note: wkr5_1933 omitted because of collinearity
note: wkr6_1933 omitted because of collinearity
note: wkr7_1933 omitted because of collinearity
note: wkr8_1933 omitted because of collinearity
note: wkr9_1933 omitted because of collinearity
note: wkr10_1933 omitted because of collinearity
note: wkr11_1933 omitted because of collinearity
note: wkr12_1933 omitted because of collinearity
note: wkr13_1933 omitted because of collinearity
note: wkr14_1933 omitted because of collinearity
note: wkr15_1933 omitted because of collinearity
note: wkr16_1933 omitted because of collinearity
note: wkr17_1933 omitted because of collinearity
note: wkr18_1933 omitted because of collinearity
note: wkr19_1933 omitted because of collinearity
note: wkr20_1933 omitted because of collinearity
note: wkr21_1933 omitted because of collinearity
note: wkr22_1933 omitted because of collinearity
note: wkr23_1933 omitted because of collinearity
note: wkr24_1933 omitted because of collinearity
note: wkr25_1933 omitted because of collinearity
note: wkr26_1933 omitted because of collinearity
note: wkr27_1933 omitted because of collinearity
note: wkr28_1933 omitted because of collinearity
note: wkr29_1933 omitted because of collinearity
note: wkr30_1933 omitted because of collinearity
note: wkr31_1933 omitted because of collinearity
note: wkr32_1933 omitted because of collinearity
note: wkr33_1933 omitted because of collinearity
note: wkr34_1933 omitted because of collinearity
note: wkr35_1933 omitted because of collinearity
note: 5.yearDes omitted because of collinearity
note: 6.yearDes omitted because of collinearity
note: 7.yearDes omitted because of collinearity
note: 8.yearDes omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,713
Group variable: id                              Number of groups  =        959

R-sq:                                           Obs per group:
     within  = 0.9718                                         min =          2
     between = 0.0002                                         avg =        4.9
     overall = 0.0093                                         max =          5

                                                F(220,958)        =          .
corr(u_i, Xb)  = -0.9928                        Prob > F          =          .

                                      (Std. Err. adjusted for 959 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
     Nazi_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        ss_artf |   .0280355   .0071659     3.91   0.000     .0139728    .0420983
          pop_1 |  -.0182016   .0396823    -0.46   0.647    -.0960758    .0596726
        pop_2_1 |   .0002203   .0002366     0.93   0.352     -.000244    .0006847
        pop_3_1 |  -6.35e-07   5.96e-07    -1.07   0.287    -1.80e-06    5.34e-07
        pop_4_1 |   5.77e-10   5.51e-10     1.05   0.296    -5.05e-10    1.66e-09
        pop_5_1 |  -1.12e-13   1.05e-13    -1.07   0.287    -3.19e-13    9.44e-14
     jewishpop1 |  -209.3209   41.15211    -5.09   0.000    -290.0796   -128.5622
       cathpop1 |   21.52173   2.024568    10.63   0.000     17.54863    25.49483
    bluecollar1 |   11.31409   3.717347     3.04   0.002     4.019005    18.60917
   whitecollar1 |   20.32329    6.80683     2.99   0.003     6.965275    33.68131
          city1 |   .7462747   .9336522     0.80   0.424    -1.085965    2.578514
warparticipant1 |  -.0764176   .0890044    -0.86   0.391    -.2510836    .0982484
       welfare1 |   .0329555   .0233395     1.41   0.158     -.012847     .078758
    socialrent1 |   .0789833   .0607564     1.30   0.194    -.0402477    .1982143
       proptax1 |   .5358501   .3458595     1.55   0.122    -.1428796     1.21458
      altitude1 |  -.0130819   .0018112    -7.22   0.000    -.0166362   -.0095275
    unemployed1 |   49.10815   10.08115     4.87   0.000     29.32447    68.89182
    partemploy1 |  -10.55543   9.594502    -1.10   0.272     -29.3841    8.273234
          bigd1 |   .3725851   .2452949     1.52   0.129    -.1087922    .8539625
       turnout1 |   26.96522   4.461417     6.04   0.000     18.20994     35.7205
     dnvpshare1 |  -20.30196   2.607471    -7.79   0.000    -25.41898   -15.18495
     nsfpshare1 |   9.697566   8.679056     1.12   0.264     -7.33459    26.72972
      spdshare1 |   18.14907   3.314962     5.47   0.000     11.64364    24.65449
  zentrumshare1 |   6.238356   2.411714     2.59   0.010     1.505504    10.97121
          pop_2 |  -.0446215   .0395299    -1.13   0.259    -.1221967    .0329537
        pop_2_2 |   .0003475   .0002292     1.52   0.130    -.0001023    .0007974
        pop_3_2 |  -9.53e-07   5.63e-07    -1.69   0.091    -2.06e-06    1.52e-07
        pop_4_2 |   8.73e-10   5.16e-10     1.69   0.091    -1.39e-10    1.89e-09
        pop_5_2 |  -1.68e-13   9.80e-14    -1.71   0.087    -3.60e-13    2.44e-14
     jewishpop2 |  -150.0276   39.59767    -3.79   0.000    -227.7358   -72.31945
       cathpop2 |   17.25099   2.146465     8.04   0.000     13.03867     21.4633
    bluecollar2 |   5.358163   3.463522     1.55   0.122    -1.438802    12.15513
   whitecollar2 |   27.86402   5.912095     4.71   0.000     16.26187    39.46617
          city2 |   .7178165   .9070167     0.79   0.429    -1.062152    2.497785
warparticipant2 |  -.0085771   .0841783    -0.10   0.919    -.1737723    .1566181
       welfare2 |   .0335111   .0242884     1.38   0.168    -.0141535    .0811757
    socialrent2 |   .0314353   .0651777     0.48   0.630    -.0964722    .1593428
       proptax2 |   .6917714   .3713726     1.86   0.063    -.0370262    1.420569
      altitude2 |  -.0099388   .0018102    -5.49   0.000    -.0134913   -.0063864
    unemployed2 |   42.16826   9.717993     4.34   0.000     23.09725    61.23927
    partemploy2 |  -9.777127   11.05498    -0.88   0.377     -31.4719    11.91764
          bigd2 |   .1360067   .2295863     0.59   0.554    -.3145434    .5865568
       turnout2 |   10.69557   4.928022     2.17   0.030     1.024603    20.36653
     dnvpshare2 |  -2.551556   2.861067    -0.89   0.373    -8.166238    3.063125
     nsfpshare2 |   21.41267   8.963432     2.39   0.017     3.822441     39.0029
      spdshare2 |   20.76823   3.552456     5.85   0.000     13.79674    27.73972
  zentrumshare2 |   .5917762   2.402725     0.25   0.806    -4.123435    5.306988
          pop_3 |  -.0134525   .0337559    -0.40   0.690    -.0796965    .0527915
        pop_2_3 |   .0000637   .0001558     0.41   0.683     -.000242    .0003693
        pop_3_3 |  -1.19e-07   3.23e-07    -0.37   0.712    -7.53e-07    5.14e-07
        pop_4_3 |   5.70e-11   2.76e-10     0.21   0.836    -4.85e-10    5.99e-10
        pop_5_3 |  -1.24e-14   5.20e-14    -0.24   0.812    -1.15e-13    8.98e-14
     jewishpop3 |  -62.44474   28.71087    -2.17   0.030    -118.7882   -6.101291
       cathpop3 |  -7.056855   1.206367    -5.85   0.000    -9.424282   -4.689428
    bluecollar3 |    .950723   1.604659     0.59   0.554    -2.198329    4.099775
   whitecollar3 |   12.99391   3.522334     3.69   0.000     6.081533    19.90629
          city3 |  -.2474161   .5008227    -0.49   0.621    -1.230252    .7354201
warparticipant3 |   -.019495   .0514216    -0.38   0.705    -.1204069    .0814169
       welfare3 |   .0178995   .0142733     1.25   0.210     -.010111    .0459099
    socialrent3 |   .0189975   .0364656     0.52   0.603    -.0525642    .0905593
       proptax3 |    .371368   .1875849     1.98   0.048     .0032432    .7394927
      altitude3 |  -.0017358   .0010709    -1.62   0.105    -.0038375    .0003659
    unemployed3 |   21.20962   6.218254     3.41   0.001     9.006646    33.41259
    partemploy3 |   .9466556   6.687755     0.14   0.887    -12.17768      14.071
          bigd3 |   .0787232    .125986     0.62   0.532    -.1685172    .3259636
       turnout3 |   4.900915   2.868651     1.71   0.088    -.7286503    10.53048
     dnvpshare3 |   6.771424   1.662749     4.07   0.000     3.508373    10.03448
     nsfpshare3 |    9.02215    3.50234     2.58   0.010     2.149007    15.89529
      spdshare3 |   2.079377   1.962459     1.06   0.290    -1.771839    5.930592
  zentrumshare3 |   3.278548   1.427095     2.30   0.022     .4779543    6.079141
          pop_4 |  -.0115468   .0347622    -0.33   0.740    -.0797657    .0566721
        pop_2_4 |   .0000363   .0001594     0.23   0.820    -.0002766    .0003492
        pop_3_4 |  -3.59e-08   3.32e-07    -0.11   0.914    -6.87e-07    6.15e-07
        pop_4_4 |  -2.98e-11   2.95e-10    -0.10   0.920    -6.09e-10    5.49e-10
        pop_5_4 |   4.43e-15   5.57e-14     0.08   0.937    -1.05e-13    1.14e-13
     jewishpop4 |   5.327903   27.34634     0.19   0.846    -48.33774    58.99355
       cathpop4 |   -2.40404   1.125753    -2.14   0.033    -4.613267   -.1948125
    bluecollar4 |   2.677936   1.653315     1.62   0.106    -.5666004    5.922472
   whitecollar4 |   8.692079    3.03305     2.87   0.004     2.739891    14.64427
          city4 |  -.2087544    .453631    -0.46   0.645    -1.098979    .6814707
warparticipant4 |   .0492553   .0473578     1.04   0.299    -.0436816    .1421923
       welfare4 |   .0046343   .0133746     0.35   0.729    -.0216125    .0308812
    socialrent4 |   .0406129   .0350236     1.16   0.247     -.028119    .1093447
       proptax4 |  -.2232091   .1964456    -1.14   0.256    -.6087225    .1623044
      altitude4 |  -.0012514   .0011391    -1.10   0.272    -.0034869    .0009841
    unemployed4 |   18.13922   4.459616     4.07   0.000     9.387476    26.89096
    partemploy4 |  -.1019274   5.701185    -0.02   0.986    -11.29018    11.08633
          bigd4 |   .1525935   .1228368     1.24   0.214    -.0884667    .3936537
       turnout4 |   6.005893   2.837838     2.12   0.035     .4367964    11.57499
     dnvpshare4 |   5.450941   1.419003     3.84   0.000     2.666228    8.235655
     nsfpshare4 |   9.154223   3.745856     2.44   0.015     1.803193    16.50525
      spdshare4 |   8.556036   1.888965     4.53   0.000     4.849048    12.26302
  zentrumshare4 |   3.982795   1.370262     2.91   0.004     1.293734    6.671856
          pop_5 |  -.0192298   .0320264    -0.60   0.548    -.0820797    .0436201
        pop_2_5 |   .0000737   .0001129     0.65   0.514    -.0001478    .0002953
        pop_3_5 |  -9.24e-08   1.11e-07    -0.83   0.407    -3.11e-07    1.26e-07
        pop_4_5 |          0  (omitted)
        pop_5_5 |          0  (omitted)
     jewishpop5 |          0  (omitted)
       cathpop5 |          0  (omitted)
    bluecollar5 |          0  (omitted)
   whitecollar5 |          0  (omitted)
          city5 |          0  (omitted)
warparticipant5 |          0  (omitted)
       welfare5 |          0  (omitted)
    socialrent5 |          0  (omitted)
       proptax5 |          0  (omitted)
      altitude5 |          0  (omitted)
    unemployed5 |          0  (omitted)
    partemploy5 |          0  (omitted)
          bigd5 |          0  (omitted)
       turnout5 |          0  (omitted)
     dnvpshare5 |          0  (omitted)
     nsfpshare5 |          0  (omitted)
      spdshare5 |          0  (omitted)
  zentrumshare5 |          0  (omitted)
           wkr1 |          0  (omitted)
           wkr2 |          0  (omitted)
           wkr3 |          0  (omitted)
           wkr4 |          0  (omitted)
           wkr5 |          0  (omitted)
           wkr6 |          0  (omitted)
           wkr7 |          0  (omitted)
           wkr8 |          0  (omitted)
           wkr9 |          0  (omitted)
          wkr10 |          0  (omitted)
          wkr11 |          0  (omitted)
          wkr12 |          0  (omitted)
          wkr13 |          0  (omitted)
          wkr14 |          0  (omitted)
          wkr15 |          0  (omitted)
          wkr16 |          0  (omitted)
          wkr17 |          0  (omitted)
          wkr18 |          0  (omitted)
          wkr19 |          0  (omitted)
          wkr20 |          0  (omitted)
          wkr21 |          0  (omitted)
          wkr22 |          0  (omitted)
          wkr23 |          0  (omitted)
          wkr24 |          0  (omitted)
          wkr25 |          0  (omitted)
          wkr26 |          0  (omitted)
          wkr27 |          0  (omitted)
          wkr28 |          0  (omitted)
          wkr29 |          0  (omitted)
          wkr30 |          0  (omitted)
          wkr31 |          0  (omitted)
          wkr32 |          0  (omitted)
          wkr33 |          0  (omitted)
          wkr34 |          0  (omitted)
          wkr35 |          0  (omitted)
      wkr1_1928 |  -92.73932   4.887881   -18.97   0.000    -102.3315   -83.14713
      wkr1_1930 |  -61.94769   5.658818   -10.95   0.000     -73.0528   -50.84258
  wkr1_1932_jul |  -21.63272    3.17429    -6.81   0.000    -27.86209   -15.40336
  wkr1_1932_nov |  -28.81895   3.149428    -9.15   0.000    -34.99952   -22.63838
      wkr1_1933 |          0  (omitted)
      wkr2_1928 |          0  (omitted)
      wkr2_1930 |          0  (omitted)
  wkr2_1932_jul |          0  (omitted)
  wkr2_1932_nov |          0  (omitted)
      wkr2_1933 |          0  (omitted)
      wkr3_1928 |          0  (omitted)
      wkr3_1930 |          0  (omitted)
  wkr3_1932_jul |          0  (omitted)
  wkr3_1932_nov |          0  (omitted)
      wkr3_1933 |          0  (omitted)
      wkr4_1928 |  -88.84004   5.093969   -17.44   0.000    -98.83666   -78.84341
      wkr4_1930 |  -56.77802   5.761314    -9.86   0.000    -68.08427   -45.47177
  wkr4_1932_jul |   -20.1517   3.249884    -6.20   0.000    -26.52941   -13.77399
  wkr4_1932_nov |  -24.79326    3.28725    -7.54   0.000     -31.2443   -18.34222
      wkr4_1933 |          0  (omitted)
      wkr5_1928 |  -94.02883   5.025384   -18.71   0.000    -103.8909    -84.1668
      wkr5_1930 |  -60.80407   5.771913   -10.53   0.000    -72.13112   -49.47702
  wkr5_1932_jul |  -20.16958    3.22263    -6.26   0.000    -26.49381   -13.84535
  wkr5_1932_nov |  -25.85777   3.238264    -7.99   0.000    -32.21268   -19.50286
      wkr5_1933 |          0  (omitted)
      wkr6_1928 |  -90.08942   5.105625   -17.65   0.000    -100.1089   -80.06992
      wkr6_1930 |  -58.25371   5.859643    -9.94   0.000    -69.75292   -46.75449
  wkr6_1932_jul |  -23.54031   3.296665    -7.14   0.000    -30.00983   -17.07079
  wkr6_1932_nov |  -27.55363   3.303776    -8.34   0.000    -34.03711   -21.07016
      wkr6_1933 |          0  (omitted)
      wkr7_1928 |  -96.29892   5.215394   -18.46   0.000    -106.5338     -86.064
      wkr7_1930 |  -56.95779   5.971113    -9.54   0.000    -68.67576   -45.23982
  wkr7_1932_jul |  -17.65714   3.330249    -5.30   0.000    -24.19256   -11.12171
  wkr7_1932_nov |  -22.35017   3.396454    -6.58   0.000    -29.01552   -15.68482
      wkr7_1933 |          0  (omitted)
      wkr8_1928 |  -94.37309   5.075122   -18.60   0.000    -104.3327   -84.41345
      wkr8_1930 |  -62.11185   5.698593   -10.90   0.000    -73.29501   -50.92868
  wkr8_1932_jul |  -18.75166   3.159674    -5.93   0.000    -24.95234   -12.55098
  wkr8_1932_nov |  -24.58853   3.227876    -7.62   0.000    -30.92306   -18.25401
      wkr8_1933 |          0  (omitted)
      wkr9_1928 |  -93.25638   4.775253   -19.53   0.000    -102.6275   -83.88522
      wkr9_1930 |  -67.25542   5.423618   -12.40   0.000    -77.89896   -56.61187
  wkr9_1932_jul |  -19.98781   3.081306    -6.49   0.000    -26.03469   -13.94092
  wkr9_1932_nov |  -25.07099    3.09205    -8.11   0.000    -31.13896   -19.00301
      wkr9_1933 |          0  (omitted)
     wkr10_1928 |  -93.04643   5.075018   -18.33   0.000    -103.0059     -83.087
     wkr10_1930 |  -61.63227   5.800262   -10.63   0.000    -73.01495   -50.24958
 wkr10_1932_jul |  -18.34426   3.256331    -5.63   0.000    -24.73462   -11.95389
 wkr10_1932_nov |  -22.90513   3.291465    -6.96   0.000    -29.36444   -16.44582
     wkr10_1933 |          0  (omitted)
     wkr11_1928 |  -84.99311   5.064309   -16.78   0.000    -94.93153   -75.05469
     wkr11_1930 |  -54.46811   6.006771    -9.07   0.000    -66.25606   -42.68016
 wkr11_1932_jul |  -17.53509   3.262592    -5.37   0.000    -23.93774   -11.13243
 wkr11_1932_nov |  -24.15275   3.335648    -7.24   0.000    -30.69877   -17.60673
     wkr11_1933 |          0  (omitted)
     wkr12_1928 |  -85.89773   5.004928   -17.16   0.000    -95.71961   -76.07584
     wkr12_1930 |  -55.87023   5.752864    -9.71   0.000     -67.1599   -44.58056
 wkr12_1932_jul |  -16.17791   3.120125    -5.19   0.000    -22.30098   -10.05484
 wkr12_1932_nov |   -22.1023   3.229361    -6.84   0.000    -28.43974   -15.76486
     wkr12_1933 |          0  (omitted)
     wkr13_1928 |  -91.43989   4.944739   -18.49   0.000    -101.1437   -81.73612
     wkr13_1930 |  -56.61151   5.687017    -9.95   0.000    -67.77196   -45.45106
 wkr13_1932_jul |   -16.6369   3.094518    -5.38   0.000    -22.70972   -10.56409
 wkr13_1932_nov |  -20.06282    3.15834    -6.35   0.000    -26.26088   -13.86476
     wkr13_1933 |          0  (omitted)
     wkr14_1928 |  -80.44519   4.938991   -16.29   0.000    -90.13768    -70.7527
     wkr14_1930 |  -49.73822   5.620671    -8.85   0.000    -60.76847   -38.70797
 wkr14_1932_jul |  -13.68423   3.016774    -4.54   0.000    -19.60448   -7.763981
 wkr14_1932_nov |  -19.95575    3.03774    -6.57   0.000    -25.91715   -13.99436
     wkr14_1933 |          0  (omitted)
     wkr15_1928 |  -92.85234   5.053895   -18.37   0.000    -102.7703   -82.93436
     wkr15_1930 |   -62.5523    5.60845   -11.15   0.000    -73.55856   -51.54603
 wkr15_1932_jul |  -17.37892   3.132739    -5.55   0.000    -23.52675    -11.2311
 wkr15_1932_nov |  -24.21259   3.183763    -7.61   0.000    -30.46054   -17.96463
     wkr15_1933 |          0  (omitted)
     wkr16_1928 |   -91.4961    5.03547   -18.17   0.000    -101.3779   -81.61427
     wkr16_1930 |  -56.46417   5.816419    -9.71   0.000    -67.87857   -45.04978
 wkr16_1932_jul |  -16.22338   3.395352    -4.78   0.000    -22.88657   -9.560194
 wkr16_1932_nov |  -21.72822   3.231343    -6.72   0.000    -28.06954   -15.38689
     wkr16_1933 |          0  (omitted)
     wkr17_1928 |  -87.54179   4.980022   -17.58   0.000     -97.3148   -77.76878
     wkr17_1930 |  -56.94048   5.741945    -9.92   0.000    -68.20872   -45.67224
 wkr17_1932_jul |  -18.47906   3.157102    -5.85   0.000    -24.67469   -12.28342
 wkr17_1932_nov |  -23.74122   3.200238    -7.42   0.000     -30.0215   -17.46093
     wkr17_1933 |          0  (omitted)
     wkr18_1928 |  -84.33534    5.05396   -16.69   0.000    -94.25345   -74.41724
     wkr18_1930 |  -52.50367   5.788652    -9.07   0.000    -63.86357   -41.14377
 wkr18_1932_jul |  -15.56946   3.170405    -4.91   0.000     -21.7912   -9.347723
 wkr18_1932_nov |  -19.69394   3.246743    -6.07   0.000    -26.06549   -13.32239
     wkr18_1933 |          0  (omitted)
     wkr19_1928 |  -89.83507   4.822267   -18.63   0.000     -99.2985   -80.37164
     wkr19_1930 |  -58.95292   5.602936   -10.52   0.000    -69.94837   -47.95748
 wkr19_1932_jul |   -16.8661   3.121144    -5.40   0.000    -22.99117   -10.74104
 wkr19_1932_nov |  -19.32833   3.118944    -6.20   0.000    -25.44909   -13.20758
     wkr19_1933 |          0  (omitted)
     wkr20_1928 |  -89.54791   4.758294   -18.82   0.000    -98.88579   -80.21003
     wkr20_1930 |  -54.88664   5.475629   -10.02   0.000    -65.63225   -44.14103
 wkr20_1932_jul |  -18.66926   3.103539    -6.02   0.000    -24.75978   -12.57874
 wkr20_1932_nov |  -23.45352   3.189066    -7.35   0.000    -29.71189   -17.19516
     wkr20_1933 |          0  (omitted)
     wkr21_1928 |  -87.68283   4.786635   -18.32   0.000    -97.07633   -78.28933
     wkr21_1930 |  -55.15405   5.507394   -10.01   0.000      -65.962    -44.3461
 wkr21_1932_jul |  -16.34956   3.108341    -5.26   0.000     -22.4495   -10.24961
 wkr21_1932_nov |  -22.58195   3.126455    -7.22   0.000    -28.71744   -16.44646
     wkr21_1933 |          0  (omitted)
     wkr22_1928 |  -84.99701   5.115463   -16.62   0.000    -95.03582   -74.95821
     wkr22_1930 |  -50.59867   5.834498    -8.67   0.000    -62.04854    -39.1488
 wkr22_1932_jul |  -14.52849   3.176278    -4.57   0.000    -20.76175   -8.295222
 wkr22_1932_nov |  -19.36167   3.248503    -5.96   0.000    -25.73667   -12.98666
     wkr22_1933 |          0  (omitted)
     wkr23_1928 |  -92.79617   4.935545   -18.80   0.000    -102.4819   -83.11044
     wkr23_1930 |  -56.19437    5.82303    -9.65   0.000    -67.62173     -44.767
 wkr23_1932_jul |  -16.61315   3.137188    -5.30   0.000     -22.7697    -10.4566
 wkr23_1932_nov |   -21.2862   3.236017    -6.58   0.000     -27.6367    -14.9357
     wkr23_1933 |          0  (omitted)
     wkr24_1928 |  -85.05378   5.372229   -15.83   0.000    -95.59648   -74.51109
     wkr24_1930 |  -60.10531   6.175904    -9.73   0.000    -72.22518   -47.98545
 wkr24_1932_jul |  -18.86011   3.441646    -5.48   0.000    -25.61415   -12.10608
 wkr24_1932_nov |  -23.32668   3.437224    -6.79   0.000    -30.07204   -16.58132
     wkr24_1933 |          0  (omitted)
     wkr25_1928 |  -84.04638   5.094779   -16.50   0.000    -94.04459   -74.04816
     wkr25_1930 |  -59.71494   5.859724   -10.19   0.000    -71.21432   -48.21556
 wkr25_1932_jul |  -20.94279   3.296566    -6.35   0.000    -27.41211   -14.47347
 wkr25_1932_nov |  -26.44052   3.253612    -8.13   0.000    -32.82555   -20.05549
     wkr25_1933 |          0  (omitted)
     wkr26_1928 |  -79.30692   5.120028   -15.49   0.000    -89.35469   -69.25916
     wkr26_1930 |  -55.70335   5.941946    -9.37   0.000    -67.36408   -44.04262
 wkr26_1932_jul |  -14.00046   3.244795    -4.31   0.000    -20.36818   -7.632731
 wkr26_1932_nov |   -19.0072    3.25802    -5.83   0.000    -25.40088   -12.61352
     wkr26_1933 |          0  (omitted)
     wkr27_1928 |  -89.60092   4.723917   -18.97   0.000    -98.87134    -80.3305
     wkr27_1930 |  -56.03955   5.417263   -10.34   0.000    -66.67062   -45.40848
 wkr27_1932_jul |  -10.62523   3.082201    -3.45   0.001    -16.67388   -4.576588
 wkr27_1932_nov |  -14.06696   3.135791    -4.49   0.000    -20.22078   -7.913153
     wkr27_1933 |          0  (omitted)
     wkr28_1928 |  -87.91493    5.12889   -17.14   0.000    -97.98009   -77.84978
     wkr28_1930 |  -59.84888   5.805478   -10.31   0.000     -71.2418   -48.45596
 wkr28_1932_jul |  -18.19754   3.287407    -5.54   0.000    -24.64889   -11.74619
 wkr28_1932_nov |  -23.69169   3.365937    -7.04   0.000    -30.29715   -17.08623
     wkr28_1933 |          0  (omitted)
     wkr29_1928 |  -87.40721   5.185264   -16.86   0.000    -97.58299   -77.23142
     wkr29_1930 |  -59.11243   5.908244   -10.01   0.000    -70.70702   -47.51783
 wkr29_1932_jul |  -17.22062   3.273901    -5.26   0.000    -23.64546   -10.79577
 wkr29_1932_nov |  -22.17373   3.350713    -6.62   0.000    -28.74932   -15.59815
     wkr29_1933 |          0  (omitted)
     wkr30_1928 |  -89.34334   5.001231   -17.86   0.000    -99.15797    -79.5287
     wkr30_1930 |  -56.15803   5.825773    -9.64   0.000    -67.59078   -44.72529
 wkr30_1932_jul |  -17.04986   3.211712    -5.31   0.000    -23.35266   -10.74706
 wkr30_1932_nov |  -20.19194   3.246551    -6.22   0.000    -26.56311   -13.82076
     wkr30_1933 |          0  (omitted)
     wkr31_1928 |  -81.90346   4.750903   -17.24   0.000    -91.22684   -72.58008
     wkr31_1930 |  -58.85352   5.532735   -10.64   0.000    -69.71119   -47.99584
 wkr31_1932_jul |  -19.96185   3.039616    -6.57   0.000    -25.92692   -13.99677
 wkr31_1932_nov |  -25.19391   3.115015    -8.09   0.000    -31.30695   -19.08087
     wkr31_1933 |          0  (omitted)
     wkr32_1928 |  -90.85801   4.602416   -19.74   0.000    -99.88999   -81.82603
     wkr32_1930 |  -58.62554   5.310234   -11.04   0.000    -69.04657    -48.2045
 wkr32_1932_jul |  -16.14205   2.894967    -5.58   0.000    -21.82326   -10.46084
 wkr32_1932_nov |  -21.10425   2.996489    -7.04   0.000    -26.98469   -15.22381
     wkr32_1933 |          0  (omitted)
     wkr33_1928 |  -92.45998   5.051308   -18.30   0.000    -102.3729   -82.54707
     wkr33_1930 |  -59.49335   5.580964   -10.66   0.000    -70.44568   -48.54103
 wkr33_1932_jul |  -14.28189   2.990169    -4.78   0.000    -20.14993   -8.413855
 wkr33_1932_nov |  -18.15564   3.046962    -5.96   0.000    -24.13513   -12.17615
     wkr33_1933 |          0  (omitted)
     wkr34_1928 |  -235.8774   133.1283    -1.77   0.077    -497.1342    25.37932
     wkr34_1930 |  -269.1051   119.7935    -2.25   0.025     -504.193   -34.01728
 wkr34_1932_jul |  -45.51641   59.93627    -0.76   0.448    -163.1379    72.10512
 wkr34_1932_nov |  -26.01992    63.9455    -0.41   0.684    -151.5094     99.4695
     wkr34_1933 |          0  (omitted)
     wkr35_1928 |  -90.37968    4.95745   -18.23   0.000    -100.1084   -80.65096
     wkr35_1930 |  -61.25183   5.770611   -10.61   0.000    -72.57633   -49.92733
 wkr35_1932_jul |  -18.52234   3.114987    -5.95   0.000    -24.63532   -12.40935
 wkr35_1932_nov |  -26.42362   3.204074    -8.25   0.000    -32.71143   -20.13581
     wkr35_1933 |          0  (omitted)
                |
        yearDes |
          n309  |          0  (omitted)
          n327  |          0  (omitted)
          n32n  |          0  (omitted)
          n333  |          0  (omitted)
                |
          _cons |   52.82763   7.049019     7.49   0.000     38.99433    66.66093
----------------+----------------------------------------------------------------
        sigma_u |  158.40388
        sigma_e |  3.2636281
            rho |  .99957569   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. //2
. xtreg Nazi_share ss_nl_artf pop_1-wkr35_1933 i.yearDes, fe cluster(id) 
note: pop_4_5 omitted because of collinearity
note: pop_5_5 omitted because of collinearity
note: jewishpop5 omitted because of collinearity
note: cathpop5 omitted because of collinearity
note: bluecollar5 omitted because of collinearity
note: whitecollar5 omitted because of collinearity
note: city5 omitted because of collinearity
note: warparticipant5 omitted because of collinearity
note: welfare5 omitted because of collinearity
note: socialrent5 omitted because of collinearity
note: proptax5 omitted because of collinearity
note: altitude5 omitted because of collinearity
note: unemployed5 omitted because of collinearity
note: partemploy5 omitted because of collinearity
note: bigd5 omitted because of collinearity
note: turnout5 omitted because of collinearity
note: dnvpshare5 omitted because of collinearity
note: nsfpshare5 omitted because of collinearity
note: spdshare5 omitted because of collinearity
note: zentrumshare5 omitted because of collinearity
note: wkr1 omitted because of collinearity
note: wkr2 omitted because of collinearity
note: wkr3 omitted because of collinearity
note: wkr4 omitted because of collinearity
note: wkr5 omitted because of collinearity
note: wkr6 omitted because of collinearity
note: wkr7 omitted because of collinearity
note: wkr8 omitted because of collinearity
note: wkr9 omitted because of collinearity
note: wkr10 omitted because of collinearity
note: wkr11 omitted because of collinearity
note: wkr12 omitted because of collinearity
note: wkr13 omitted because of collinearity
note: wkr14 omitted because of collinearity
note: wkr15 omitted because of collinearity
note: wkr16 omitted because of collinearity
note: wkr17 omitted because of collinearity
note: wkr18 omitted because of collinearity
note: wkr19 omitted because of collinearity
note: wkr20 omitted because of collinearity
note: wkr21 omitted because of collinearity
note: wkr22 omitted because of collinearity
note: wkr23 omitted because of collinearity
note: wkr24 omitted because of collinearity
note: wkr25 omitted because of collinearity
note: wkr26 omitted because of collinearity
note: wkr27 omitted because of collinearity
note: wkr28 omitted because of collinearity
note: wkr29 omitted because of collinearity
note: wkr30 omitted because of collinearity
note: wkr31 omitted because of collinearity
note: wkr32 omitted because of collinearity
note: wkr33 omitted because of collinearity
note: wkr34 omitted because of collinearity
note: wkr35 omitted because of collinearity
note: wkr1_1933 omitted because of collinearity
note: wkr2_1928 omitted because of collinearity
note: wkr2_1930 omitted because of collinearity
note: wkr2_1932_jul omitted because of collinearity
note: wkr2_1932_nov omitted because of collinearity
note: wkr2_1933 omitted because of collinearity
note: wkr3_1928 omitted because of collinearity
note: wkr3_1930 omitted because of collinearity
note: wkr3_1932_jul omitted because of collinearity
note: wkr3_1932_nov omitted because of collinearity
note: wkr3_1933 omitted because of collinearity
note: wkr4_1933 omitted because of collinearity
note: wkr5_1933 omitted because of collinearity
note: wkr6_1933 omitted because of collinearity
note: wkr7_1933 omitted because of collinearity
note: wkr8_1933 omitted because of collinearity
note: wkr9_1933 omitted because of collinearity
note: wkr10_1933 omitted because of collinearity
note: wkr11_1933 omitted because of collinearity
note: wkr12_1933 omitted because of collinearity
note: wkr13_1933 omitted because of collinearity
note: wkr14_1933 omitted because of collinearity
note: wkr15_1933 omitted because of collinearity
note: wkr16_1933 omitted because of collinearity
note: wkr17_1933 omitted because of collinearity
note: wkr18_1933 omitted because of collinearity
note: wkr19_1933 omitted because of collinearity
note: wkr20_1933 omitted because of collinearity
note: wkr21_1933 omitted because of collinearity
note: wkr22_1933 omitted because of collinearity
note: wkr23_1933 omitted because of collinearity
note: wkr24_1933 omitted because of collinearity
note: wkr25_1933 omitted because of collinearity
note: wkr26_1933 omitted because of collinearity
note: wkr27_1933 omitted because of collinearity
note: wkr28_1933 omitted because of collinearity
note: wkr29_1933 omitted because of collinearity
note: wkr30_1933 omitted because of collinearity
note: wkr31_1933 omitted because of collinearity
note: wkr32_1933 omitted because of collinearity
note: wkr33_1933 omitted because of collinearity
note: wkr34_1933 omitted because of collinearity
note: wkr35_1933 omitted because of collinearity
note: 5.yearDes omitted because of collinearity
note: 6.yearDes omitted because of collinearity
note: 7.yearDes omitted because of collinearity
note: 8.yearDes omitted because of collinearity

Fixed-effects (within) regression               Number of obs     =      4,713
Group variable: id                              Number of groups  =        959

R-sq:                                           Obs per group:
     within  = 0.9719                                         min =          2
     between = 0.0003                                         avg =        4.9
     overall = 0.0090                                         max =          5

                                                F(220,958)        =          .
corr(u_i, Xb)  = -0.9930                        Prob > F          =          .

                                      (Std. Err. adjusted for 959 clusters in id)
---------------------------------------------------------------------------------
                |               Robust
     Nazi_share |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
     ss_nl_artf |   .1227586   .0271217     4.53   0.000     .0695338    .1759834
          pop_1 |  -.0177095   .0396602    -0.45   0.655    -.0955403    .0601214
        pop_2_1 |   .0002186   .0002373     0.92   0.357    -.0002471    .0006844
        pop_3_1 |  -6.31e-07   5.98e-07    -1.06   0.292    -1.81e-06    5.43e-07
        pop_4_1 |   5.73e-10   5.54e-10     1.03   0.301    -5.14e-10    1.66e-09
        pop_5_1 |  -1.11e-13   1.06e-13    -1.05   0.292    -3.19e-13    9.61e-14
     jewishpop1 |  -208.2643   41.11785    -5.07   0.000    -288.9557   -127.5728
       cathpop1 |    21.5402   2.026457    10.63   0.000     17.56339      25.517
    bluecollar1 |   11.26351   3.728137     3.02   0.003     3.947253    18.57977
   whitecollar1 |   20.24881   6.808304     2.97   0.003     6.887903    33.60973
          city1 |   .7538214   .9357395     0.81   0.421    -1.082514    2.590157
warparticipant1 |  -.0785543   .0892102    -0.88   0.379    -.2536242    .0965157
       welfare1 |   .0335979   .0233979     1.44   0.151    -.0123192    .0795149
    socialrent1 |   .0801463   .0608235     1.32   0.188    -.0392164    .1995091
       proptax1 |   .5281436   .3463991     1.52   0.128    -.1516449    1.207932
      altitude1 |  -.0131511   .0018129    -7.25   0.000    -.0167088   -.0095934
    unemployed1 |   49.54646   10.08476     4.91   0.000     29.75569    69.33723
    partemploy1 |  -10.92264   9.603292    -1.14   0.256    -29.76855     7.92328
          bigd1 |   .3735911   .2455002     1.52   0.128    -.1081892    .8553714
       turnout1 |   26.90867   4.460278     6.03   0.000     18.15563    35.66172
     dnvpshare1 |  -20.27064   2.613399    -7.76   0.000    -25.39929     -15.142
     nsfpshare1 |   9.901587   8.680693     1.14   0.254    -7.133781    26.93695
      spdshare1 |    18.1955   3.318338     5.48   0.000     11.68345    24.70755
  zentrumshare1 |   6.163853   2.410612     2.56   0.011     1.433164    10.89454
          pop_2 |  -.0441131   .0394959    -1.12   0.264    -.1216216    .0333954
        pop_2_2 |   .0003473   .0002301     1.51   0.132    -.0001043    .0007989
        pop_3_2 |  -9.49e-07   5.67e-07    -1.67   0.095    -2.06e-06    1.64e-07
        pop_4_2 |   8.65e-10   5.21e-10     1.66   0.097    -1.57e-10    1.89e-09
        pop_5_2 |  -1.66e-13   9.89e-14    -1.68   0.093    -3.60e-13    2.80e-14
     jewishpop2 |  -148.6976   39.51244    -3.76   0.000    -226.2385   -71.15666
       cathpop2 |   17.16095   2.141684     8.01   0.000     12.95801    21.36388
    bluecollar2 |   5.425621   3.488515     1.56   0.120    -1.420391    12.27163
   whitecollar2 |    27.5287   5.882477     4.68   0.000     15.98467    39.07273
          city2 |   .7395716   .9061725     0.82   0.415    -1.038741    2.517884
warparticipant2 |  -.0121574   .0843284    -0.14   0.885     -.177647    .1533322
       welfare2 |   .0346907   .0242748     1.43   0.153    -.0129473    .0823286
    socialrent2 |   .0335306   .0653329     0.51   0.608    -.0946814    .1617426
       proptax2 |   .6566879   .3708842     1.77   0.077    -.0711514    1.384527
      altitude2 |  -.0100487   .0018171    -5.53   0.000    -.0136146   -.0064827
    unemployed2 |    43.3751   9.664181     4.49   0.000      24.4097    62.34051
    partemploy2 |  -10.39408    11.0294    -0.94   0.346    -32.03864    11.25049
          bigd2 |   .0908293   .2308854     0.39   0.694    -.3622703    .5439288
       turnout2 |   10.63676   4.901831     2.17   0.030     1.017197    20.25633
     dnvpshare2 |  -2.488891   2.854778    -0.87   0.384     -8.09123    3.113449
     nsfpshare2 |   21.59852   8.906869     2.42   0.015     4.119296    39.07775
      spdshare2 |   20.68675   3.548549     5.83   0.000     13.72292    27.65058
  zentrumshare2 |   .5509158   2.389463     0.23   0.818     -4.13827    5.240101
          pop_3 |  -.0121321   .0337001    -0.36   0.719    -.0782667    .0540026
        pop_2_3 |   .0000546   .0001567     0.35   0.728    -.0002529    .0003621
        pop_3_3 |  -8.91e-08   3.27e-07    -0.27   0.785    -7.31e-07    5.53e-07
        pop_4_3 |   2.32e-11   2.80e-10     0.08   0.934    -5.27e-10    5.73e-10
        pop_5_3 |  -5.81e-15   5.29e-14    -0.11   0.913    -1.10e-13    9.80e-14
     jewishpop3 |  -60.98405   28.70677    -2.12   0.034    -117.3194   -4.648649
       cathpop3 |  -7.069211   1.200122    -5.89   0.000    -9.424382   -4.714041
    bluecollar3 |   1.006771   1.613818     0.62   0.533    -2.160255    4.173797
   whitecollar3 |   12.84369   3.504638     3.66   0.000     5.966038    19.72134
          city3 |  -.2326494   .5005134    -0.46   0.642    -1.214879    .7495798
warparticipant3 |  -.0232637   .0518016    -0.45   0.653    -.1249214    .0783941
       welfare3 |   .0187965   .0142202     1.32   0.187    -.0091099    .0467029
    socialrent3 |    .021277   .0363417     0.59   0.558    -.0500415    .0925955
       proptax3 |   .3508899   .1877106     1.87   0.062    -.0174816    .7192614
      altitude3 |   -.001804   .0010894    -1.66   0.098    -.0039419    .0003339
    unemployed3 |   22.31567   6.137511     3.64   0.000     10.27115    34.36019
    partemploy3 |   .2975481      6.689     0.04   0.965    -12.82924    13.42433
          bigd3 |   .0806284   .1252836     0.64   0.520    -.1652336    .3264904
       turnout3 |   4.683503   2.839409     1.65   0.099    -.8886764    10.25568
     dnvpshare3 |   6.840132   1.659386     4.12   0.000     3.583682    10.09658
     nsfpshare3 |   9.477279   3.462348     2.74   0.006     2.682616    16.27194
      spdshare3 |   2.020666   1.955803     1.03   0.302    -1.817486    5.858819
  zentrumshare3 |   3.173846   1.422717     2.23   0.026     .3818451    5.965847
          pop_4 |  -.0101277   .0347005    -0.29   0.770    -.0782254    .0579701
        pop_2_4 |   .0000265   .0001601     0.17   0.868    -.0002877    .0003408
        pop_3_4 |  -7.12e-09   3.35e-07    -0.02   0.983    -6.65e-07    6.51e-07
        pop_4_4 |  -5.96e-11   2.99e-10    -0.20   0.842    -6.46e-10    5.27e-10
        pop_5_4 |   1.01e-14   5.63e-14     0.18   0.857    -1.00e-13    1.21e-13
     jewishpop4 |   6.001279   27.45013     0.22   0.827    -47.86805    59.87061
       cathpop4 |  -2.404515    1.12026    -2.15   0.032    -4.602961    -.206069
    bluecollar4 |   2.589045   1.662262     1.56   0.120    -.6730509    5.851141
   whitecollar4 |    8.67449   3.018872     2.87   0.004     2.750126    14.59886
          city4 |  -.1946644   .4534576    -0.43   0.668    -1.084549    .6952204
warparticipant4 |   .0456562   .0475419     0.96   0.337    -.0476421    .1389545
       welfare4 |    .005785   .0133581     0.43   0.665    -.0204296    .0319995
    socialrent4 |   .0426978   .0350042     1.22   0.223    -.0259959    .1113915
       proptax4 |  -.2364127   .1987819    -1.19   0.235    -.6265108    .1536855
      altitude4 |  -.0013036   .0011456    -1.14   0.255    -.0035518    .0009446
    unemployed4 |   18.87688   4.481246     4.21   0.000     10.08269    27.67107
    partemploy4 |  -.9174221   5.730139    -0.16   0.873     -12.1625    10.32765
          bigd4 |   .1591081   .1222172     1.30   0.193    -.0807363    .3989525
       turnout4 |   5.670875   2.820022     2.01   0.045      .136741    11.20501
     dnvpshare4 |   5.449014   1.424765     3.82   0.000     2.652993    8.245036
     nsfpshare4 |   9.843607   3.744611     2.63   0.009     2.495019    17.19219
      spdshare4 |   8.663741   1.877512     4.61   0.000     4.979229    12.34825
  zentrumshare4 |    3.89838   1.368933     2.85   0.004     1.211928    6.584833
          pop_5 |  -.0192998   .0319419    -0.60   0.546     -.081984    .0433844
        pop_2_5 |   .0000745   .0001129     0.66   0.509    -.0001471    .0002962
        pop_3_5 |  -9.39e-08   1.12e-07    -0.84   0.400    -3.13e-07    1.25e-07
        pop_4_5 |          0  (omitted)
        pop_5_5 |          0  (omitted)
     jewishpop5 |          0  (omitted)
       cathpop5 |          0  (omitted)
    bluecollar5 |          0  (omitted)
   whitecollar5 |          0  (omitted)
          city5 |          0  (omitted)
warparticipant5 |          0  (omitted)
       welfare5 |          0  (omitted)
    socialrent5 |          0  (omitted)
       proptax5 |          0  (omitted)
      altitude5 |          0  (omitted)
    unemployed5 |          0  (omitted)
    partemploy5 |          0  (omitted)
          bigd5 |          0  (omitted)
       turnout5 |          0  (omitted)
     dnvpshare5 |          0  (omitted)
     nsfpshare5 |          0  (omitted)
      spdshare5 |          0  (omitted)
  zentrumshare5 |          0  (omitted)
           wkr1 |          0  (omitted)
           wkr2 |          0  (omitted)
           wkr3 |          0  (omitted)
           wkr4 |          0  (omitted)
           wkr5 |          0  (omitted)
           wkr6 |          0  (omitted)
           wkr7 |          0  (omitted)
           wkr8 |          0  (omitted)
           wkr9 |          0  (omitted)
          wkr10 |          0  (omitted)
          wkr11 |          0  (omitted)
          wkr12 |          0  (omitted)
          wkr13 |          0  (omitted)
          wkr14 |          0  (omitted)
          wkr15 |          0  (omitted)
          wkr16 |          0  (omitted)
          wkr17 |          0  (omitted)
          wkr18 |          0  (omitted)
          wkr19 |          0  (omitted)
          wkr20 |          0  (omitted)
          wkr21 |          0  (omitted)
          wkr22 |          0  (omitted)
          wkr23 |          0  (omitted)
          wkr24 |          0  (omitted)
          wkr25 |          0  (omitted)
          wkr26 |          0  (omitted)
          wkr27 |          0  (omitted)
          wkr28 |          0  (omitted)
          wkr29 |          0  (omitted)
          wkr30 |          0  (omitted)
          wkr31 |          0  (omitted)
          wkr32 |          0  (omitted)
          wkr33 |          0  (omitted)
          wkr34 |          0  (omitted)
          wkr35 |          0  (omitted)
      wkr1_1928 |  -90.52793   4.934798   -18.34   0.000    -100.2122   -80.84367
      wkr1_1930 |  -56.64138   5.833953    -9.71   0.000    -68.09018   -45.19258
  wkr1_1932_jul |  -17.08374    3.45465    -4.95   0.000    -23.86329   -10.30418
  wkr1_1932_nov |   -24.2809   3.449947    -7.04   0.000    -31.05122   -17.51057
      wkr1_1933 |          0  (omitted)
      wkr2_1928 |          0  (omitted)
      wkr2_1930 |          0  (omitted)
  wkr2_1932_jul |          0  (omitted)
  wkr2_1932_nov |          0  (omitted)
      wkr2_1933 |          0  (omitted)
      wkr3_1928 |          0  (omitted)
      wkr3_1930 |          0  (omitted)
  wkr3_1932_jul |          0  (omitted)
  wkr3_1932_nov |          0  (omitted)
      wkr3_1933 |          0  (omitted)
      wkr4_1928 |  -86.63206   5.150122   -16.82   0.000    -96.73889   -76.52524
      wkr4_1930 |  -51.90336   5.968487    -8.70   0.000    -63.61617   -40.19054
  wkr4_1932_jul |  -15.57303    3.54183    -4.40   0.000    -22.52367   -8.622389
  wkr4_1932_nov |   -20.2496   3.584188    -5.65   0.000    -27.28337   -13.21583
      wkr4_1933 |          0  (omitted)
      wkr5_1928 |  -91.79218   5.077548   -18.08   0.000    -101.7566   -81.82778
      wkr5_1930 |  -56.03068   5.947857    -9.42   0.000    -67.70301   -44.35835
  wkr5_1932_jul |   -15.5948   3.483057    -4.48   0.000     -22.4301   -8.759501
  wkr5_1932_nov |  -21.25464   3.524789    -6.03   0.000    -28.17184   -14.33744
      wkr5_1933 |          0  (omitted)
      wkr6_1928 |  -87.68888   5.158621   -17.00   0.000    -97.81238   -77.56538
      wkr6_1930 |   -53.2701   6.035698    -8.83   0.000    -65.11482   -41.42538
  wkr6_1932_jul |  -18.72832   3.558949    -5.26   0.000    -25.71256   -11.74409
  wkr6_1932_nov |  -22.62109   3.592908    -6.30   0.000    -29.67197   -15.57021
      wkr6_1933 |          0  (omitted)
      wkr7_1928 |  -94.08065   5.276093   -17.83   0.000    -104.4347   -83.72661
      wkr7_1930 |  -52.20194   6.170509    -8.46   0.000    -64.31122   -40.09267
  wkr7_1932_jul |   -13.1136   3.616553    -3.63   0.000    -20.21088   -6.016322
  wkr7_1932_nov |  -17.79464   3.727224    -4.77   0.000    -25.10911   -10.48018
      wkr7_1933 |          0  (omitted)
      wkr8_1928 |  -92.18817   5.129062   -17.97   0.000    -102.2537   -82.12268
      wkr8_1930 |  -57.46513   5.878613    -9.78   0.000    -69.00158   -45.92868
  wkr8_1932_jul |  -14.21075    3.42604    -4.15   0.000    -20.93416   -7.487344
  wkr8_1932_nov |  -20.09935   3.524617    -5.70   0.000    -27.01621   -13.18249
      wkr8_1933 |          0  (omitted)
      wkr9_1928 |  -91.04833    4.84439   -18.79   0.000    -100.5552   -81.54149
      wkr9_1930 |  -62.40595   5.658403   -11.03   0.000    -73.51025   -51.30166
  wkr9_1932_jul |  -15.47295   3.405822    -4.54   0.000    -22.15668   -8.789212
  wkr9_1932_nov |  -20.56386   3.439869    -5.98   0.000     -27.3144   -13.81331
      wkr9_1933 |          0  (omitted)
     wkr10_1928 |  -90.86033   5.124835   -17.73   0.000    -100.9175   -80.80313
     wkr10_1930 |  -56.96629   5.972983    -9.54   0.000    -68.68793   -45.24465
 wkr10_1932_jul |  -13.85751   3.514691    -3.94   0.000    -20.75489   -6.960131
 wkr10_1932_nov |  -18.33629   3.577324    -5.13   0.000    -25.35659     -11.316
     wkr10_1933 |          0  (omitted)
     wkr11_1928 |   -82.7579   5.118881   -16.17   0.000    -92.80341   -72.71239
     wkr11_1930 |  -49.70622   6.185235    -8.04   0.000    -61.84439   -37.56804
 wkr11_1932_jul |  -13.04715   3.535059    -3.69   0.000     -19.9845   -6.109792
 wkr11_1932_nov |  -19.55243   3.626722    -5.39   0.000    -26.66967   -12.43519
     wkr11_1933 |          0  (omitted)
     wkr12_1928 |  -83.66219    5.05898   -16.54   0.000    -93.59016   -73.73423
     wkr12_1930 |  -51.15305    5.93197    -8.62   0.000     -62.7942   -39.51189
 wkr12_1932_jul |  -11.59692   3.394244    -3.42   0.001    -18.25793   -4.935909
 wkr12_1932_nov |  -17.39844   3.535675    -4.92   0.000      -24.337   -10.45988
     wkr12_1933 |          0  (omitted)
     wkr13_1928 |  -89.15435   4.998872   -17.83   0.000    -98.96435   -79.34435
     wkr13_1930 |  -51.77336   5.866214    -8.83   0.000    -63.28547   -40.26125
 wkr13_1932_jul |  -11.99704   3.385936    -3.54   0.000    -18.64175   -5.352332
 wkr13_1932_nov |  -15.37564   3.463527    -4.44   0.000    -22.17262   -8.578666
     wkr13_1933 |          0  (omitted)
     wkr14_1928 |  -78.04248   4.986474   -15.65   0.000    -87.82815    -68.2568
     wkr14_1930 |  -44.77948   5.788795    -7.74   0.000    -56.13966   -33.41929
 wkr14_1932_jul |  -8.864249   3.294538    -2.69   0.007    -15.32959   -2.398904
 wkr14_1932_nov |  -15.06321   3.345312    -4.50   0.000     -21.6282   -8.498226
     wkr14_1933 |          0  (omitted)
     wkr15_1928 |  -90.52289   5.107936   -17.72   0.000    -100.5469   -80.49886
     wkr15_1930 |  -57.72493   5.798737    -9.95   0.000    -69.10462   -46.34524
 wkr15_1932_jul |   -12.6861   3.404331    -3.73   0.000    -19.36691   -6.005293
 wkr15_1932_nov |  -19.44288   3.474287    -5.60   0.000    -26.26097   -12.62479
     wkr15_1933 |          0  (omitted)
     wkr16_1928 |   -89.2116   5.082969   -17.55   0.000    -99.18664   -79.23656
     wkr16_1930 |   -51.6742   5.985289    -8.63   0.000    -63.41999   -39.92841
 wkr16_1932_jul |  -11.57803    3.63918    -3.18   0.002    -18.71971   -4.436343
 wkr16_1932_nov |  -17.02232    3.52183    -4.83   0.000    -23.93371   -10.11093
     wkr16_1933 |          0  (omitted)
     wkr17_1928 |  -85.27844   5.025602   -16.97   0.000     -95.1409   -75.41598
     wkr17_1930 |  -52.09593   5.906011    -8.82   0.000    -63.68614   -40.50572
 wkr17_1932_jul |  -13.82432   3.422887    -4.04   0.000    -20.54154   -7.107097
 wkr17_1932_nov |  -19.09677   3.496239    -5.46   0.000    -25.95794   -12.23559
     wkr17_1933 |          0  (omitted)
     wkr18_1928 |  -82.04514    5.12115   -16.02   0.000     -92.0951   -71.99517
     wkr18_1930 |  -47.46483     6.0209    -7.88   0.000     -59.2805   -35.64915
 wkr18_1932_jul |  -10.82806   3.503999    -3.09   0.002    -17.70446   -3.951661
 wkr18_1932_nov |  -15.01941   3.595138    -4.18   0.000    -22.07466   -7.964153
     wkr18_1933 |          0  (omitted)
     wkr19_1928 |  -87.60885   4.879485   -17.95   0.000    -97.18457   -78.03314
     wkr19_1930 |   -54.1633   5.809594    -9.32   0.000     -65.5643    -42.7623
 wkr19_1932_jul |  -12.32884   3.420231    -3.60   0.000    -19.04085   -5.616828
 wkr19_1932_nov |  -14.77447   3.447094    -4.29   0.000    -21.53919   -8.009739
     wkr19_1933 |          0  (omitted)
     wkr20_1928 |  -87.36217   4.816662   -18.14   0.000     -96.8146   -77.90974
     wkr20_1930 |  -49.93278   5.693534    -8.77   0.000    -61.10602   -38.75954
 wkr20_1932_jul |  -14.02556   3.423489    -4.10   0.000    -20.74397   -7.307162
 wkr20_1932_nov |  -18.94421   3.503369    -5.41   0.000    -25.81937   -12.06905
     wkr20_1933 |          0  (omitted)
     wkr21_1928 |  -85.43937   4.848444   -17.62   0.000    -94.95417   -75.92457
     wkr21_1930 |  -50.41448    5.71272    -8.82   0.000    -61.62537   -39.20359
 wkr21_1932_jul |  -11.79263   3.406788    -3.46   0.001    -18.47826   -5.107004
 wkr21_1932_nov |  -18.00782   3.453116    -5.21   0.000    -24.78436   -11.23127
     wkr21_1933 |          0  (omitted)
     wkr22_1928 |  -82.57166   5.191986   -15.90   0.000    -92.76064   -72.38269
     wkr22_1930 |  -45.34062   6.110121    -7.42   0.000    -57.33139   -33.34986
 wkr22_1932_jul |  -9.700399   3.530046    -2.75   0.006    -16.62792   -2.772883
 wkr22_1932_nov |  -14.39083   3.642405    -3.95   0.000    -21.53885   -7.242819
     wkr22_1933 |          0  (omitted)
     wkr23_1928 |  -90.51602   4.997724   -18.11   0.000    -100.3238   -80.70827
     wkr23_1930 |  -51.16981   6.028207    -8.49   0.000    -62.99982    -39.3398
 wkr23_1932_jul |  -11.85767      3.463    -3.42   0.001    -18.65361   -5.061727
 wkr23_1932_nov |  -16.60783    3.57027    -4.65   0.000    -23.61428   -9.601373
     wkr23_1933 |          0  (omitted)
     wkr24_1928 |  -82.80261   5.444708   -15.21   0.000    -93.48754   -72.11768
     wkr24_1930 |  -55.17462   6.412161    -8.60   0.000    -67.75812   -42.59112
 wkr24_1932_jul |  -14.24234   3.759345    -3.79   0.000    -21.61984   -6.864839
 wkr24_1932_nov |  -18.68274   3.762556    -4.97   0.000    -26.06654   -11.29893
     wkr24_1933 |          0  (omitted)
     wkr25_1928 |  -81.82806   5.156339   -15.87   0.000    -91.94708   -71.70903
     wkr25_1930 |  -54.88299   6.066781    -9.05   0.000    -66.78871   -42.97728
 wkr25_1932_jul |   -16.2968   3.587471    -4.54   0.000    -23.33701   -9.256594
 wkr25_1932_nov |  -21.73088   3.564103    -6.10   0.000    -28.72523   -14.73653
     wkr25_1933 |          0  (omitted)
     wkr26_1928 |  -77.10996   5.179971   -14.89   0.000    -87.27536   -66.94456
     wkr26_1930 |  -50.89302   6.148761    -8.28   0.000    -62.95961   -38.82643
 wkr26_1932_jul |  -9.469584   3.538648    -2.68   0.008    -16.41398   -2.525188
 wkr26_1932_nov |  -14.45969   3.565776    -4.06   0.000    -21.45733   -7.462059
     wkr26_1933 |          0  (omitted)
     wkr27_1928 |  -87.42856   4.782753   -18.28   0.000    -96.81444   -78.04268
     wkr27_1930 |  -51.33462   5.635306    -9.11   0.000    -62.39359   -40.27565
 wkr27_1932_jul |  -6.069972   3.411205    -1.78   0.075    -12.76427    .6243234
 wkr27_1932_nov |  -9.619154   3.471127    -2.77   0.006    -16.43104   -2.807264
     wkr27_1933 |          0  (omitted)
     wkr28_1928 |  -85.68954   5.183218   -16.53   0.000    -95.86132   -75.51777
     wkr28_1930 |  -55.08764   5.996699    -9.19   0.000    -66.85583   -43.31946
 wkr28_1932_jul |  -13.68996   3.557605    -3.85   0.000    -20.67155   -6.708358
 wkr28_1932_nov |   -19.1077   3.659999    -5.22   0.000    -26.29024   -11.92516
     wkr28_1933 |          0  (omitted)
     wkr29_1928 |  -85.10745   5.246767   -16.22   0.000    -95.40394   -74.81097
     wkr29_1930 |  -54.28996    6.10854    -8.89   0.000    -66.27763    -42.3023
 wkr29_1932_jul |  -12.65781   3.555445    -3.56   0.000    -19.63517   -5.680449
 wkr29_1932_nov |  -17.52036   3.658238    -4.79   0.000    -24.69945   -10.34128
     wkr29_1933 |          0  (omitted)
     wkr30_1928 |  -87.17762   5.054961   -17.25   0.000    -97.09769   -77.25754
     wkr30_1930 |  -51.63426   5.985179    -8.63   0.000    -63.37984   -39.88869
 wkr30_1932_jul |  -12.63555   3.469778    -3.64   0.000    -19.44479   -5.826307
 wkr30_1932_nov |  -15.61917    3.53062    -4.42   0.000    -22.54781   -8.690531
     wkr30_1933 |          0  (omitted)
     wkr31_1928 |  -79.61536    4.82421   -16.50   0.000     -89.0826   -70.14812
     wkr31_1930 |  -53.95969   5.768962    -9.35   0.000    -65.28095   -42.63842
 wkr31_1932_jul |  -15.23107   3.398044    -4.48   0.000    -21.89954   -8.562602
 wkr31_1932_nov |  -20.55986   3.486659    -5.90   0.000    -27.40223   -13.71749
     wkr31_1933 |          0  (omitted)
     wkr32_1928 |  -88.56513   4.670211   -18.96   0.000    -97.73016   -79.40011
     wkr32_1930 |  -53.71164   5.533285    -9.71   0.000     -64.5704   -42.85288
 wkr32_1932_jul |  -11.42342    3.24915    -3.52   0.000    -17.79969    -5.04715
 wkr32_1932_nov |  -16.46727   3.349744    -4.92   0.000    -23.04095   -9.893586
     wkr32_1933 |          0  (omitted)
     wkr33_1928 |  -90.29378   5.112733   -17.66   0.000    -100.3272   -80.26033
     wkr33_1930 |  -54.81409   5.777295    -9.49   0.000     -66.1517   -43.47647
 wkr33_1932_jul |  -9.816808   3.298718    -2.98   0.003    -16.29036   -3.343261
 wkr33_1932_nov |  -13.71424    3.37219    -4.07   0.000    -20.33197   -7.096505
     wkr33_1933 |          0  (omitted)
     wkr34_1928 |  -233.0394   134.0872    -1.74   0.083    -496.1778    30.09908
     wkr34_1930 |  -260.3992   121.3051    -2.15   0.032    -498.4536   -22.34478
 wkr34_1932_jul |  -31.54152   60.85062    -0.52   0.604    -150.9574    87.87437
 wkr34_1932_nov |  -13.79308   64.47753    -0.21   0.831    -140.3266    112.7404
     wkr34_1933 |          0  (omitted)
     wkr35_1928 |  -88.09058   5.011089   -17.58   0.000    -97.92456   -78.25661
     wkr35_1930 |  -56.49335   5.936362    -9.52   0.000    -68.14312   -44.84357
 wkr35_1932_jul |  -13.92603   3.388406    -4.11   0.000    -20.57558   -7.276471
 wkr35_1932_nov |  -21.75871   3.500701    -6.22   0.000    -28.62864   -14.88878
     wkr35_1933 |          0  (omitted)
                |
        yearDes |
          n309  |          0  (omitted)
          n327  |          0  (omitted)
          n32n  |          0  (omitted)
          n333  |          0  (omitted)
                |
          _cons |   50.72322   7.065938     7.18   0.000     36.85672    64.58972
----------------+----------------------------------------------------------------
        sigma_u |  161.06514
        sigma_e |  3.2610847
            rho |  .99959023   (fraction of variance due to u_i)
---------------------------------------------------------------------------------

. 
. 
. 
end of do-file

